[
  {
    "id": 1,
    "novel_id": 1,
    "title": "Daily Life at Hogwarts",
    "content": "\n\n\r\n\r\n\r\nChapter 1 The Owl Postman\nIn the early morning, a ray of sunlight shone through the gap in the curtains and reflected on the sleeping face of the boy.Albert hasn't woken up yet, but will be awakened soon.\nThe door on the second floor by the stairs was quietly pushed open, the brown-haired girl stuck her head in, her big brown eyes stared at the boy who was still sleeping on the bed, and whispered, \"Albert, it's time to get up.\"\nSeeing that the boy on the bed did not respond, the girl pouted in dissatisfaction, pushed open the door and walked in, followed by a British shorthair cat.\n\"Tom, please.\" The girl put the shorthair cat on the bed, gently picked up the cat's tail, and swept the boy's face twice.\nOriginally, Albert, who was still sleeping, stretched out the cat's tail on his face, opened his eyes and looked at his naughty sister, stretched out his hand to cover a yawn, and said hello, \"Good morning, Nia!\"\n\"Dad said to take us to London today.\" Nia blinked, looked at Albert and said, \"Go and customize the school uniform of Eton College for you, and buy the items on the list by the way.\"\n\"Okay, got it, I'll change my clothes.\" Albert covered his yawn again, picked up the shorthair cat that was stretching its claws on the sheet, put it on the ground, stretched out, and started changing clothes, Then wash up and head to the living room for breakfast.\n\"Stay up late last night again?\" Daisy put the hearty breakfast on the plate in front of Albert's table.\n\"Son, we'd better hurry up, today's schedule is a bit full.\" Herb spread out the letter from Eton College a few days ago on the table with a proud smile on his face.\nAs we all know, private schools in the UK are the place to cultivate elites, and Eton College is one of the best among them. If you want to enter this school, you must meet two points: talent and wealth.\nThe Anderson family belongs to the middle class in the UK. The husband and wife run a law firm and have a savings at home.\nAs for Albert, he is a genius in everyone's eyes. Not only did he have excellent grades, he also participated in many competitions between schools and won awards.\nWhether Albert is a genius in people's eyes, only he knows.\ngenius?\nNo, Albert never considered himself a genius.Albert has a big unknown secret, he is a traveler.\nAs for why he was named a genius, he himself was inexplicable.\nA child who doesn't know what a Rubik's Cube is, but can easily spell a messed up third-order Rubik's Cube.\nIn the eyes of most adults, this is genius.\nIn fact, the reason that he can spell the Rubik's Cube well is because he has played it in his previous life and knows the secret of the Rubik's Cube, so he knows how to spell it well.\nAs for how to maintain the image of a genius, Albert is not at all worried that he will be exposed, because he has the legendary golden finger!\nTravelers have their own golden fingers, and online novels will not deceive me.\nSpeaking of this, when Albert was seven years old, he found that a panel suddenly appeared in his brain.\nThe panel has two major functions, accepting tasks and adding skills.\nSometimes there will be some quests, and after completing the quests, you can get experience or skill points, experience can be used to improve skills, and skill points can directly improve 1-level skills.\nThe first skill Albert possessed was English proficiency, and it took him years to get to level 3.\nIf it is said that the English proficiency of ordinary British is level 2, the average English teacher is level 3.\nAs long as the technical skills are increased to max, Albert can become a genius scientist.\nOf course, Albert never wanted to be a scientist, nor did he have such a desire in his previous life.\nIn his last life, he liked to read books, and finally became an ordinary online novelist.\nI have written a few books, and I have a small savings. I live a carefree life and do what I like every day.\nIn other words, the previous life was actually a salted fish.\nAs for how did he get through?\nAshamed to say.\nOne day, he leaned on the sofa and watched a Mr. Bean movie, and took an apple while watching it. Because the movie was so funny, he forgot that he was still chewing food, and he choked to death on an apple piece. 30 years old.\nAfter waking up again, I found myself turned into a baby. After a stumble in this house for many years, I raised a new cat, also named Tom.\nOf course, the name actually comes from the Tom and Jerry anime.\nAt the age of seven, the game panel suddenly appeared, which made Albert begin to doubt his life, and even once doubted whether he was an NPC in a certain game.\nLater, I never found a creature like the player, so I regarded the panel as the gospel of the traveler.\nCombining time-travel and golden fingers is equal to a winner in life.\nAlbert has no big ambitions. He thinks it would be best for him to have a few relationships as an adult and have a simple and easy job after graduating from university.It is best to get married before the age of 30 and earn enough wealth to spend a hundred years, allowing him to spend the rest of his life freely and carefree.\nIn order to realize such a future, Albert already has his own plans, and he is ready to enter Wall Street in the United States after graduation.Relying on the economic skills of reaching the max, plus the residual memory of the previous life, I believe that I can make a lot of dollars soon.\nHowever, the panel skills are not easy to upgrade, especially after the second level, each level requires a lot of experience.\nAlbert needs to do tasks to earn experience and skill points, and being admitted to Eton College is one of the tasks.\n\"Son, what are you thinking?\" Herb cut the steak on the plate with a knife and looked at his son who was in a daze.\n\"I was thinking, what will I do in the future?\" Albert put the poached egg into his mouth and swallowed it before he said.\n\"Then what do you want to do in the future?\" Daisy asked curiously. Couples rarely hear their children mention their dreams.\n\"Finance.\" Albert said without hesitation.\n\"We thought you would want to be a scientist or an astronaut.\" The Andersons looked at each other.\n\"What is finance?\" Nia was unhappy that she was excluded from the conversation by her family.\n\"Finance is easy to make money.\" Albert raised his head and said, \"This time, by the way, help me buy a few books on economics as a prepaid birthday present.\"\n\"Son, don't mislead your sister, only powerful guys can make money in this field.\" Herb's face twitched, he clenched his fist and covered his mouth and coughed lightly, \"Also, our family is not poor.\"\n\"Okay, eat breakfast, stop talking nonsense.\" Daisy interrupted, \"Nia, remember to drink up all the milk.\"\n\"Oh!\" Nia doesn't like drinking milk very much.\nAfter the rebirth, everything is beautiful. He has a lovely sister, a harmonious family, a prosperous life, and a golden finger that can lead him to the peak of life.\nIf the only thing that upsets Albert is definitely British food.\nIn the past, he was dubious when it was said on the Internet that Britain was a food desert. After all, most British people like a simple and comfortable life.\nHowever, after experiencing it firsthand, there is no longer any doubt about the veracity of those descriptions.\nAfter the meal was over, help clear the tableware, close the doors and windows, and the Anderson family was ready to go out together.\nAlbert just opened Ford's door and was about to get into the back seat of the car when he suddenly heard a surprised voice from Nia next to him, \"Look, is it an owl?\"\nThe Andersons looked suspiciously in the direction of their daughter's finger, and saw an owl flying towards them, passing a letter over the heads of the crowd, and throwing a letter at Albert's feet.\nAt this moment, the expressions on the Anderson family's faces froze.\nOwl, deliver a letter?\nWhen did the owl also start working as a part-time postman?\n(End of this chapter)\n\n\n\n"
  },
  {
    "id": 10,
    "novel_id": 1,
    "title": "Daily Life at Hogwarts",
    "content": "\n\n\r\n\r\n\r\nChapter 10 My Family Is Professional\nGabriel Truman also has no good solution. He can only accept Albert's proposal. Being expelled from Hogwarts is a result that he cannot accept anyway.\nAfter writing the letter, Truman looked at the flying owl, looked at Albert and asked, \"Is this really all right?\"\n\"The school is probably also taken aback. I don't think they will dismiss a student at will. At least they will figure out what's going on.\" Albert comforted, the freckled boy calmed down. , it should be said that he was infected by Albert's calmness.\n\"Can you lend me that letter?\" Albert asked.\n\"Oh, here, what a disaster.\" Truman smiled bitterly. \"I was warned once by the Ministry of Magic for using magic in front of my family during the summer vacation of my first year.\"\nHe handed the letter to Albert, explaining, \"Hogwarts students are not allowed to use magic outside of school.\"\n\"But why was Albert not warned after using magic?\" Nia was puzzled.\n\"It's very likely that he hasn't gone to school yet.\" In fact, Truman didn't quite know.\n\"Probably some loophole.\" Albert began to read the parchment:\nDear Mr. Truman: We have received information that you were in a Muggle settlement at [-]:[-] noon and cast a Levitation Charm in the presence of a Muggle.\nSeeing this, Albert's emotions were a bit complicated. He knew who the Muggle was referring to, took a deep breath, sorted out the complicated emotions, and continued to read.\nThis behavior seriously violates the \"Act on Reasonable Restraint of Underage Wizards\". Since you have previously been formally warned for violating Article No.13 of the \"International Confederation of Magicians' Secrecy Act\", we regret to inform you that you Must go to the Ministry of Magic for trial at 8 am on August 17.\nIf convicted, you will be expelled from Hogwarts School of Witchcraft and Wizardry and the Ministry of Magic will destroy your wand.\nHope you take care.\nYour faithful Mafalda Hopekirk Ministry of Magic forbids the misuse of the Division of Magic.\n\"I suggest that after this matter is resolved, apply to the Ministry of Magic for spiritual compensation.\" Albert's family are all lawyers, and he still learned a bit about how to exploit legal loopholes.\nTruman was a little stunned, and he didn't even understand what was going on. The other party actually said that he should apply for spiritual compensation from the Ministry of Magic?\n\"I dare say that the Ministry of Magic must have a way to monitor your surroundings, but they don't know who used the magic.\" Albert continued, \"I only came here for the summer vacation with my sister a few days ago, because You just happened to bump into us, so the Ministry of Magic thinks you used the Levitate Charm and is going to fire you. In fact, it was their gross mistake, and the letter surprised you a lot, didn't you? It just nearly got out of control, and it's definitely going to pay for the mental damage.\"\n\"Yes, it is completely reasonable to ask for a mental damage fee.\" Nia echoed.\n\"My family are all lawyers, so I know these things better than you.\" Albert continued to instigate, \"Someone will come over later, at least someone will write a letter, anyway, clear your business first. Then, Complain about the mistakes of the Ministry of Magic and ask them to pay you 100 Galleons for your fright.\"\n\"Will it be too much.\" Truman was startled by Albert's lion opening.\n\"This will make it easier to explain.\" Albert said without hesitation, \"At least, 50 Galleons is not too much. If it is lower than this number, don't want it, lest they think that children are fooled, and adults are like this, they think children are easy to pass. \"\n\"If the Ministry of Magic doesn't give you the money, I can write you a letter and have the Daily Prophet dig this out anonymously, and I'm sure they'll be willing to pay you 50 Galleons. You'll get the money, though. You need to share half of it with me as the cost of writing letters for you.\" Albert's remarks made Truman feel that this child is too cute... too powerful.\n……\nHogwarts, Headmaster's Office, Dumbledore has just been notified by the Ministry of Magic that Gabriel Truman needs to be tried at the Ministry of Magic for using the Levitation Charm in front of Muggles. Once the Ministry of Magic's charges are established, Truman will will be expelled from school.\nThis is not good news, Truman has a criminal record and was warned by the Ministry of Magic for using magic in front of his family during the summer of his first year.\nJust as Dumbledore was about to go to the Ministry of Magic to confirm the situation, a letter from Owl surprised him.\nThe letter described that Truman had nothing to do with this matter, he just met a freshman who was about to enter the school in the park and was practicing the floating spell, and the Muggle was referring to the other party's sister.\nIt's not like a lie, because there is another letter in the letter, and his owner is Albert Anderson.\nIn the letter, Albert expressed his regret for the unwarranted disaster he brought to Truman, and said that he could testify for him if necessary.\nDumbledore found the name in his memory. It was indeed a freshman in the first year, from a Muggle family.\nDumbledore couldn't help but breathe a sigh of relief, he thought this was probably the case.Expelling a student is definitely not something he, the principal, would like to see.\nDumbledore immediately went to the Ministry of Magic, and talked about the letter and the matter to the person who prohibited the abuse of magic. The matter was not serious enough to need a trial. If it was just an accident, the Ministry of Magic might become a laughing stock.\nAfter all, both Dumbledore and the Ministry of Magic knew there was a loophole in the trace.\nThe fact was similar to what Albert had guessed. Someone from the Ministry of Magic came. He also saw Dumbledore. The old man smiled and looked at the two children talking in the park.\n\"It seems that this should be a misunderstanding.\" Dumbledore said to the Ministry of Magic staff next to him with a smile.\n\"I think you should be Headmaster Dumbledore.\" Albert looked at Dumbledore, reached out and shook hands with him and said, \"You are the same as the picture of the Chocolate Frog.\"\n\"Mr. Albert?\" Dumbledore looked at Albert and said with a smile, \"We received your letter, child, can you give me the wand?\"\n\"Oh, of course no problem.\" Albert knew what Dumbledore wanted to do, so he gave him the wand anyway.\nSure enough, the headmaster used a flashback spell to detect the magic that the wand owner had used in recent days.\nDumbledore looked at Albert in amazement. This child actually mastered five magics in just a few days.\n\"Truman just corrected my levitation spell, which I just mastered,\" Albert explained.\n\"Where's your wand?\" The wizard from the Ministry of Magic looked at Truman.\n\"I didn't bring it with me. I kept it at home. If you need to check it, you can go back and get it with me.\" Truman was very righteous, and he was not afraid of checking anyway.\n\"It seems that this was a misunderstanding, Nutley.\" Dumbledore said with a smile.\n\"Yes, I think so too.\" Nutley nodded. \"I think I need to write a new report.\"\n　The Ministry of Magic has no right to expel a student from Hogwarts nor to confiscate a wand unless the charges are convicted.\n　　This is my negligence. I should go to the Ministry of Magic's Prohibition of Misuse of Magic Division to be tried first, and then I will be expelled from the school and destroyed the wand if the charges are established.\n　　\n　\n(End of this chapter)\n\n\n\n"
  },
  {
    "id": 100,
    "novel_id": 1,
    "title": "Daily Life at Hogwarts",
    "content": "\n\n\r\n\r\n\r\nChapter 100 His Teeth\nReturning to the locker room, Albert immediately picked up his wand and used a drying spell on himself to dry the rain off his body.\n\"Put the protective gear and Quidditch costumes in the basket.\" Charlie pointed to the big basket in the corner and reminded, \"By the way, I'll go to the school hospital later to find Madam Pomfrey and get some cold medicine. Drink, don't catch a cold in the rain.\"\n\"Actually, you want to see those unlucky Slytherins, by the way, disgust them!\" Erin immediately guessed Charlie's sinister intentions\n\"Jack also needs Madam Pomfrey to check, he just fell too hard.\" Danny reminded with a light cough.\n\"It's not all your fault.\" Jack complained loudly.\n\"How did you do it, the clothes on your body... became dry?\" Wood was surprised when he noticed that Albert was about to put on a winter cloak.\n\"Of course it's using a drying spell,\" Albert asked, noticing the puzzled gazes of several people, \"You... don't know?\"\nSeveral people looked at each other, but no one really knew the drying spell.\nAlbert suddenly didn't know what to say.\n\"There is a record of drying spells in Practical Family Magic.\" Albert looked at the suddenly quiet locker room and said the books that Professor Flitwick suggested he read.Of course, he hadn't actually read the book himself.\n\"You actually read this kind of book?\" Erin looked at Albert in surprise.\n\"Isn't magic just to save trouble?\" Albert rubbed his nose and said, \"I feel like I'm about to catch a cold.\"\n\"Ah!\" Mario sneezed and complained, \"Go back to the castle, I want to take a hot bath first.\"\n\"Excuse me.\" Erin said with a smile.\nAfter Albert used the drying spell to dry the clothes of the others, they returned to the castle together.\nEveryone came to the corridor of the school hospital on the second floor of the castle and found that a large group of people had gathered here. They were all spectators watching the Quidditch match in the rain. Get some cold-prevention medicine.\nThe arrival of the Gryffindor team attracted the attention of a large crowd, and the crowd made way for them.\nCharlie greeted acquaintances with a smile and led the team into the school hospital.\nMadam Pomfrey was distributing potions, and Charlie greeted her, pretending to put Jack on the hospital bed, and showing a malicious smile at the Slytherin pursuit hand montage in the next hospital bed, Ai. Burt read their lips: we won!\n\"Mrs Pomfrey, we also need some potions in case everyone catches a cold after getting wet in the rain.\" Erin said to the head nurse who came over.\n\"On the table, a small cup per person, go get it yourself.\" Madam Pomfrey came over to check on Jack's injury, complaining that their game was so messed up that they deserved to be injured or something.\nIt took her less than a minute to heal Jack's injury.\nWhile they were drinking the cold-prevention medicine, the Slytherin team members also came, and the atmosphere in the ward suddenly became very tense.\n\"Okay, don't crowd here.\" Madam Pomfrey kicked Charlie and his party out of the ward, and Albert saw at a glance the backup goalie Vicki, who had his teeth knocked out, and tried to intercept himself, but did not stop the broom , The two unlucky bastards who crashed into the auditorium, they were being supported by other team members and seemed to be seriously injured.\n\"By the way, the guy who threw the bat at you was locked up by Professor McGonagall.\" Before leaving the ward, Mark suddenly turned his head and licked at someone's back, \"The bat he threw at you. You hit someone, and he and another unlucky guy who tried to stop you rushed into the Slytherin auditorium before they could stop, and injured several...\"\nMark's voice was loud enough for everyone in the school hospital to hear, and the student who was receiving the potion next to him couldn't help but burst into laughter.\nThe Slytherin team collectively turned around and glared, if not in the school hospital, they might have scuffled.\n\"What's the matter with those teeth in your mouth? How many of them are lost? It doesn't matter, right?\" Danny asked with his eyes on the substitute goalkeeper Vicki, holding back a smile.\n\"Cough, hurry up.\" Charlie quickly pushed everyone and led them out of the school hospital.\n\"I really hope Madam Pomfrey doesn't fill his teeth and let him talk all the time.\" Fred couldn't help laughing. \"By the way, it's really cool who did it.\"\n\"It seems to be knocked off by Albert.\" Jack said, he wanted to stop Albert, but... Jack laughed to himself before he finished speaking.\n\"Don't look at me, he hit my elbow himself and knocked it off,\" Albert said innocently, \"At that time, I was focused on staring at the Snitch, and I didn't have time to hit him, that guy didn't know why, Just had to hit my elbow, it's still a little sore there.\"\n\"Maybe, he has a strange disease that makes him uncomfortable without being slapped in the face. I hope Madam Pomfrey can cure him.\" George's sympathetic look made everyone amused.\n\"Go, go back and celebrate this victory.\"\n\"Let's go to the kitchen and get something to eat.\" George and Fred were going to try their luck in the kitchen.\n\"No need, Professor McGonagall has prepared it for you!\" Li Jordan came out of the corner without warning, patted Albert on the shoulder and said: \"I have seen it all, you put Slytherin The goalkeeper's teeth were knocked out.\"\n\"He knocked it down himself,\" Albert corrected.\n\"None of you noticed how ugly Professor Snape's face was when you caught the Snitch, like someone smeared his face...\" Li Jordan's voice stopped abruptly, because He saw Albert raised his finger, motioning him not to speak, and quickly looked up and looked around, and found that Snape was not nearby, and couldn't help but lightly hammered Albert's shoulder with his fist.\nThe others couldn't help but laugh.\nOf course, the only unhappy person in the corridor was probably Filch. The manager stood at the door of the school hospital with a mop and a bucket, and looked at him with malicious eyes.Filch maintained order and waited for the students to disperse so that the hallway could be cleared of muddy footprints.\nAs soon as everyone returned to the common room, loud cheers erupted inside. People shouted his name when they saw Albert, and even a few hands couldn't wait to drag him in.\nSome cakes, pies, candies, and a large jug of pumpkin juice were on the table in the common room, and many people gathered around Albert, telling him about the thrilling scene before catching the Snitch, and some people talking about him The last thing that knocked out the Slytherin goalie's tooth.\nHowever, Abbott insisted that it was the Slytherin backup goalkeeper who knocked his elbow and knocked out his teeth.\nHe is a good man, how could he do such a thing.\nAfter finally getting rid of everyone's entanglement, Albert took a small plate with cakes and sat on the armchair in the corner.\n\"Yes, I didn't expect your Quidditch to fly well.\" Field next to him put his chin in one hand and teased, \"If you were a little older, I couldn't help but chase you.\"\nAlbert suddenly became a little embarrassed. Are foreign girls so sturdy?\nOf course, he also knew that Field was just teasing himself, so he whispered back: \"Actually, I don't like girls older than me very much!\"\n\"You're old?\" Field couldn't help but rolled his eyes at Albert, and changed the subject: \"How is your summoning practice?\"\n\"It's okay, I'm trying to summon other things now.\" Albert thought about his progress in learning the summoning technique, and nodded with satisfaction, \"After a while, you can successfully summon an umbrella.\"\n\"What are you calling the umbrella for?\" Field asked in confusion.\n\"Of course you don't need to bring an umbrella when it rains in the future.\" Albert said solemnly, \"Britain is a rainy country. Sometimes you don't bring an umbrella when you go out, and when you come back, you get wet.\"\nField: \"...\" It sounds like it makes sense.\n(End of this chapter)\n\n\n\n"
  },
  {
    "id": 101,
    "novel_id": 1,
    "title": "Daily Life at Hogwarts",
    "content": "\n\n\r\n\r\n\r\nChapter 101 The Rumor Maker\nThe fiasco that the Slytherin team liked to hear became the topic of chat among Hogwarts students after dinner.The matter of the unlucky substitute goalkeeper Vicky Avery has become a topic of many people's talking and laughing. Even though Madam Pomfrey has already repaired his knocked teeth, but the students of other colleges always think of him when they see him. It reminds me of the saying in Gryffindor College: \"It was he who knocked my elbow and knocked my teeth out.\"\nNo one really cared how much Albert's words were true, they just laughed at little Avery for knocking out his own teeth.\nJust laughing at it for the sake of being annoying.\nAt least, that's what Albert thinks, otherwise there would be something funny in that sentence, even he couldn't find it himself.\nThis wave really stabilized the hatred value for him, so stable that even the task on the panel popped up.\nAlbert didn't care much, because after the game between Gryffindor and Slytherin, the smell of gunpowder between the two sides became stronger.\nThe atmosphere between the two chambers is very tense, even to the point of breaking out.\nIn the corridor, there were often small fights that made Filch's mouth twitch with anger. The number of violations has increased sharply in the recent period, and he used up all his small rolls of parchment.\nIn the end, it really turned into a very bad incident.\nSeveral Slytherin students blocked Mark, and when they were about to do something, a few Gryffindor students \"coincidentally\" passed by and got involved in the chaos.\nIt ends with weird scales growing on a Gryffindor student's face and leeks protruding from a Slytherin's nose.\nProfessor McGonagall was very angry when he learned about it, and both Gryffindor and Slytherin were deducted a large number of points.\nNow, one is back at the bottom and the other is second to last.\nOf course, there are quite a few Slytherin students who trouble Albert. After all, it is a shame for them to be defeated by a freshman from Muggles.\nHowever, there are not many opportunities for Slytherin students. Someone once tried to trip Albert by sticking out his legs in the corridor. However, one of the guys who did this was stepped on and went directly to the school hospital. One was kicked in the calf, and tears flowed out on the spot in pain.\nWhat annoyed them the most was that the freshman would always look at him helplessly and say in a very calm tone: Are you okay, why are your legs sticking out and so on.\nIn short, it means that I am innocent and harmless, and everything is your fault.\nThis is also irrefutable, because it is you who stretched out your leg to trip someone, and accidentally injured it.\nAs for containment?\nThere are always three friends by Albert's side, and it is rare for them to be alone, and even if they are alone, most of them stay in the library.\nThis guy is still very patient, and has been ambushing outside the library for a long time, but no one has yet come out of the library.\nHowever, this is not the worst.\nNot long ago, a third-year Slytherin student thought he had seized the opportunity to follow Albert into the boys' bathroom, but was found to have stepped on the water on the ground and fell down by himself, and passed out.\nOf course, there is always more than one person who is not willing to die.\nGeorge walked alone in the empty corridor on the second floor, not far from an abandoned women's bathroom.\nHe hummed a ditty, and he didn't seem to realize that someone was following him behind him.The fifth-year Slytherin senior was sneaking his wand out of his robes, preparing to cast a jinx on George.\nHowever, when he raised his wand, he found that the freshman walking in front turned his head and smiled at him.\nBefore the unlucky guy recovered his senses and figured out what happened, a slight sound suddenly sounded from behind.\nfainted!\nThese were the last words he heard before passing out.\nAfter being hit by the Stunning Curse, he fell to the ground and passed out.\n\"Another guy looking for trouble!\" George stepped forward, kicked the opponent's body with his toes, and grinned, \"Well, I didn't expect that, I have a helper here.\"\n\"Stop talking nonsense, carry it into the women's bathroom, and prepare to surprise everyone.\"\nA few minutes later, a few low-grade Hufflepuff girls passed by the door of the women's bathroom, and they saw a guy whose head was wrapped in a raised robe from a distance.\nThe other party was lying on the door of the women's bathroom, half of his body was inside, and his hands were making a climbing movement, as if he wanted to climb out of the women's bathroom.\nHearing the movement, Filch hurried over, and seeing the large pool of water in the corridor, the muscles of his face trembled twice.\nThis is... I fell to the ground by myself?\nBy the way, what does a guy do in the ladies' room?What did he see, why did he crawl out in a panic?\nThe brain power of these girls is extremely powerful. Before Filch found two passing students to pick up the drenched hapless guy from the ground and send him to the school hospital, their minds had already popped up. A lot of guesswork.\nThe Albert quartet who \"coincidentally\" passed by nearby witnessed this scene with their own eyes, and their ribs ached from holding back their laughter.\nWhy did the Slytherin student escape from the ladies' room in such a mess?\nThe girls who were the first to find out used their brain power very well to guess why the boy broke into the abandoned women's bathroom and why he escaped from the women's bathroom in embarrassment.\n\"Next time, if someone dares to trouble us again, just...\" Fred made a pawing motion, \"By the way, put his head in the toilet.\"\n\"Some jokes can't be taken too far.\" Albert tried not to let himself laugh too much, but he still didn't forget to remind, \"However, next time we meet again, we will stun them and put them in the women's bathroom In the cubicle, I believe the girls will not easily pass him by.\"\n\"That's a good idea!\" George blinked and said, \"I'm suddenly looking forward to it.\"\n\"They're definitely on guard.\"\n\"Of course. However, I don't think they would have guessed that you know how to use the Disillusionment Charm.\" Li Jordan pointed out their biggest advantage. The Slytherin students completely underestimated Albert's ability.\nBecause of the Illusion Curse, I never thought that someone would hide behind them and wait for a slap in the face, and Albert also used the Stunning Spell, which could easily turn people over.\nAlthough some people suspected that Albert was playing tricks, they quickly ruled out several people.After all, no matter how talented a Muggle wizard is, it is impossible for him to master too much magic in a short period of time.\nAs for the few people around Albert, it is obviously impossible. There are not many precedents for new students who can master the stun spell, even in Slytherin.\nTherefore, this blame was finally thrown to the senior students of Gryffindor.\nAfter all, Mark and the others have precedents!\n(End of this chapter)\n\n\n\n"
  },
  {
    "id": 102,
    "novel_id": 1,
    "title": "Daily Life at Hogwarts",
    "content": "\n\n\r\n\r\n\r\nChapter 102 Alchemy\nAlbert was sitting in a corner of the library, dragging his chin with one hand, and casually flipping through the catalog orders in the Fengya wizard clothing store with the other, planning to choose a suitable Christmas gift.\nOriginally, he planned to make an amulet for Nia himself, but after reading several books on alchemy, he temporarily dismissed this idea.\nAlbert found that his original idea was very unrealistic. Although wizards can cast spells on items and give them some magical properties, the magic on the items usually cannot last for too long and will disappear with the passage of time.\nIn Albert's opinion, it is more meaningful to buy Nia a scarf than to make an amulet that will expire soon as a birthday present.\nCreating a powerful and long-lasting magic item is by no means an easy task.\nFirst of all, you need to use some items that carry magic power as raw materials, and during the entire manufacturing process, you also need to cast spells on those raw materials for manufacturing.After the work is completed, there is still a process of casting a spell on the finished product. Whether the caster is strong enough and skillful in using magic will determine whether the magic item is strong enough and durable.\nIn ancient times, wizards would carve some runes on magical items to further enhance the effect of magic.However, there are very few wizards who can do this today, and the legacy of ancient skills is mostly lost.\nUsing this complex and tedious process, the result is usually a powerful and long-lasting magic item.\nOf course, there are places called alchemy items.\nTo be honest, the British wizarding community doesn't pay much attention to alchemy.\nThe concept of alchemy originally originated from the area of ​​ancient Greece and ancient Egypt, and was introduced to Western Europe in the 12th century.\nThe early wizards had a very vague concept of alchemy, and didn't even know what it was.\nAlbert read the famous \"Jade Record\" in ancient Egypt in the library, but he didn't understand the meaning of it. The first sentence of the book was translated to mean:\nAs it is above, as it is below; in this way, the miracle of the One is fulfilled.\nThe second sentence is: All things are originally the One, and were created from the One by differentiation...\nAfter reading it forcibly and memorizing it, Albert closed the \"Jade Record\" and stuffed it back on the bookshelf.Old books are often full of complex and esoteric concepts that make it hard to understand.\nAlbert's only understanding after reading the two sentences of \"The Jade Record\" is, is he talking about the universe or something?He really didn't think about the meaning of that book, maybe, one day he learned alchemy, maybe he suddenly realized it?\nAnyway, early alchemy involved many fields.\nWhat about exploring the mysteries of magic, the form of matter, and early cosmology, anyway, it's just a bunch of things integrated into alchemical theory.\nLater alchemy became obsessed with metal smelting, which is why some metalsmiths were crowned so-and-so alchemists in later generations, although they might prefer to call themselves metal craftsmen.\nAfter centuries of development, alchemy established the transformation of matter after being studied by great alchemists such as Albert, Thomas von Aquinas, Roger Bacon, Arnold von Wilanova, etc. philosophy,\nRaymond Luller even put forward the hypothesis of the Philosopher's Stone, also known as the Philosopher's Stone, based on the theory of \"understanding, decomposing, and reconstructing\".\nThis assumption was made by Nicole Mailer,\nThrough the Philosopher's Stone, that is, the Philosopher's Stone, the early idea of ​​completing transformation by adding \"seeds\" to \"transformation\" was realized, and the elixir of life was successfully produced, and any metal could be turned into pure gold.\nNicole Mailer, who created the Sorcerer's Stone, is therefore regarded as the ancestor of European alchemy, standing at the pinnacle of alchemy and overlooking all alchemists.\nHowever, through the continuation of the ages, the concept of material transformation eventually favored potions.\nAlthough metal craftsmen are also crowned with the title of alchemist, however, this group of people obviously do not have that kind of self-awareness, and the branch of alchemy also falls on the mysticism.\nAfter all, making magic items is what metalsmiths often do. They are good at using magic to process metals and create some magic items with hidden magical powers.\nGoblins are the best among them. They are good at sterling silver products made by using goblin magic. Those things are similar to Mithril in the magic world in this world.\nHowever, after a few days, the goblin forging sterling silver technology has also been lost, and only a small number of goblin craftsmen can forge goblin iron.\nAfter the profession of metal craftsmen gradually disappeared, alchemy completely moved closer to the mysticism. However, most alchemists did not recognize that those items that were simply cast could be called alchemical items.\nHowever, there are also some guys who call it modern alchemy, and the \"Simple Alchemy\" that Albert once read is one of them.\nAfter learning more about alchemy, Albert has a new copy of making amulets.He needs to find a bunch of magic materials that contain protective meaning, and put them together to make amulets. The amulets produced in this way will greatly strengthen the protective magic that Albert finally releases on the amulets.\nFor example, the guardian tree or the yew tree with magical power, the garnet known as the stone of life and the body stone... use EIHWAZ, which symbolizes protection and defense in runes, and other runes The combined use of runes can strengthen the protective power of the amulet.\nUnfortunately, although the idea is bad, the reality is cruel.Albert needs more knowledge to help him complete this structure, and he himself has basically no understanding of runes, that is, ancient runes.\nRegarding the records of ancient runes, they are more about interpretation and understanding, rather than deeper things. Maybe Dumbledore has studied these things, but there are very few wizards who really know how to use them. not enough.\nAlbert put aside the idea of ​​making an amulet as a gift. In fact, he already had a more suitable choice, and he was almost done.\nA griffin that symbolizes Gryffindor.\nThis is Albert's inspiration when he was practicing basic movement magic, using wood, gears and magic to create a moving griffin.\nWhat got him to do it was the model of the dragon on the Goblet of Fire, a scale model of a waving one.\nThat's right, after gaining a few levels of economics-related skills, various tricks began to appear in Albert's mind, such as the idea of ​​selling various models of magical creatures in the future, and maybe he could make a lot of money.\nAfter all, he can find someone to cooperate, set up a company or something, and invest and provide related technologies himself.\nIn order to carve the griffin, Albert went to the spiral staircase of the principal's office on the third floor, observed a griffin statue for a long time, and took several photos from all angles.\nHe also upgraded his carving skills to a level by the way, using the wood of the guardian tree provided by Hagrid, he pieced together a griffin. The basic movement magic can even make it flap its wings. As for whether it can fly, of course it is currently impossible.\nAs for the future, Albert believes that he can do it and perfect it thoroughly.After all, he has a panel, so how could he not be confident!\nAs for who to cooperate with, Albert even already has a candidate, such as a certain unlucky guy who was crushed.\n(End of this chapter)\n\n\n\n"
  },
  {
    "id": 103,
    "novel_id": 1,
    "title": "Daily Life at Hogwarts",
    "content": "\n\n\r\n\r\n\r\nChapter 103 Fist and Truth\nAlbert found a good item in the catalog order, it was a small and exquisite silver phoenix badge, but the price was a bit expensive and needed a Galleon.\nHowever, Albert is still going to order the owl as a Christmas present for Nia.\nAfter closing the catalog order and putting it back into the school bag, he closed the thick book on the table and was about to put it back to its original position. When Albert passed the bookshelf with the book, he looked at an acquaintance in surprise.\n\"I've encountered a lot of trouble recently!\" Truman said with a little surprise on his face when he saw Albert, \"However, you did a good job.\"\n\"Thank you.\" Albert asked curiously after putting the book back on the shelf, \"What are you looking for?\"\n\"A jinx, a useful jinx!\" Truman muttered in a low voice, \"I'm going to duel with Ravenclaw Prefect Notch.\"\nAlbert couldn't help being stunned when he heard this, what kind of show operation is this?\n\"A duel between you and the prefect of Ravenclaw?\" Albert asked in a low voice.\nTruman nodded.\n\"What's going on? Are you planning to hesitate to exchange ideas, or... use a duel to resolve conflicts?\" Albert has actually guessed that possibility. If it was a friendship exchange, Truman would not have come here to find useful curses . \"However, I'm afraid the school won't be too happy. They won't want to see students use duels to solve problems, and...\"\nAlbert thinks that Truman has little chance of winning. Since the opponent is a Ravenclaw prefect, it means that his grades are not bad, and there will be a gap in the mastery and application of magic between the two sides.\n\"Notch insists that Bridget Wenlock came from Ravenclaw.\" There was a hint of annoyance in Truman's tone.\n\"Bridget Wenlock?\" Albert asked suspiciously, he had never heard of this name.\n\"Bridget Wenlock was a famous arithmetic divination scientist in the thirteenth century. He was the first person to discover the magical properties of the number seven.\" Truman explained: \"I am learning arithmetic divination and chatting with others about this. Later, when he passed by, he said that Wenlock was from Ravenclaw, and I disputed this, and then, it became like this.\"\n\"So, Bridget Wenlock is a Hufflepuff.\"\n\"Of course, the chocolate frog card has an introduction of Bridget Wenlock.\" Truman took out a chocolate frog card and handed it to Albert.\nAfter reading it, Albert asked, \"Why didn't you give this to him at the time.\"\n\"I asked a friend to ask for this later.\" Truman explained, \"Also, I don't think the other party would admit it even if I showed it to him. That guy must have known that he was wrong, so he just refused to admit it.\"\nAlbert already understood the reason for their duel,\nThe typical argument turned into mutual spraying, and then evolved into beating people with hands and feet.\nIn his previous life, Albert had seen too much of this kind of thing, and there are a lot of people on the Internet who have this kind of virtue.However, because there is a layer of network, and they cannot climb over the network cable to beat people, so there is no manipulation, and they can only spray each other on network forums.\nThis time is different, both sides have become angry from embarrassment.\nPerhaps, at the beginning, the Ravenclaw prefect himself remembered it wrongly. When the two sides sprayed each other until they blushed, even if they realized their mistake, they would not admit it. That's why it turned into this duel.\nApparently, the Ravenclaw prefect was furious, or so Truman thought.\nNot everyone has the courage to admit their mistakes like Gryffindor, no, even Gryffindor, few have the courage, just like the classic quote Dumbledore said: People are easy Forgive others for their mistakes, but it is difficult to forgive others for their right.\nTruman just wanted to protect the glory of Hufflepuff. At least, from their point of view, their academy finally got rid of a famous person, and you have no shame in insisting that it belongs to Ravenclaw.\n\"Do you need me to give you a little advice?\" Albert said in a low voice.\n\"Okay!\" Truman looked forward to Albert's proposal a little bit.\n\"It's not a duel, it will get you into trouble.\" Albert reminded, \"Don't admit that it is a duel.\"\nTruman was a little regretful: \"...\"\n\"You sure don't want to be locked up!\" Albert said.\n\"No.\" Truman nodded repeatedly.\n\"Can you disarm the spell?\"\n\"No.\" Truman said gloomily.\n\"Follow me!\" Albert signaled Truman to go out with him. The library is not a good place to talk. He has noticed that Mrs. Pince is looking towards this side. If you don't want to be kicked out by the chicken blanket, then Just leave by yourself.\nThe two walked out of the library one after the other and came to the corridor outside.\nAlbert looked at the Slytherin students passing by, narrowed his eyes and said to Truman: \"The disarming spell is to remove your weapon, that's what he meant, it is to remove the opponent's weapon.\"\n\"You mean, get rid of Notch's weapon.\" Truman's tone was a little excited. If a wizard loses his wand, it's like a tiger loses his minions.\n\"Yes. However, you must be the first to use it first.\" Albert suddenly said: \"You must count one, two, three in a duel. When you count to one, you should attack him first, otherwise you probably won't be him. opponent.\"\n\"But...\" Truman seemed to want to say something, but was interrupted by Albert.\n\"This is not a duel, is it?\" Albert said lightly, \"Wait until you disarm Noch, and while he is in a daze, use a body-binding spell, you know how to use it!\"\n\"Yes.\" Truman nodded.\n\"Then, go up and beat him until he realizes that he is wrong.\" Albert made a punching motion.\n\"Using fists?\" Truman couldn't understand Albert's thinking mode.\n\"There is a saying that the truth is held in the fist.\" Albert looked at the stunned Truman and said, \"Besides, he was indeed wrong, he refused to admit it, and wanted to teach you a lesson through a duel. You are two years older and know more about magic than you...\"\nAlbert suddenly paused, and his eyes fell on a certain red-haired girl in Ravenclaw.\n\"You know Isobel, right?\"\n\"I've met people in the same club a few times.\" Albert continued after confirming that no one was around, \"There is a saying that you can never wake up people who pretend to be asleep. The best way to wake them up is to wake them up.\"\n\"Beat him hard!\" Truman suddenly felt that it made sense, so what about a sneak attack, what he wanted was to give him a hard lesson.\nAlbert nodded and said: \"Remember, don't use jinxes. Using jinxes is worse than using fists. At that time, after you are caught, you can tell Professor Sprout why you fought. Remember , It's a fight, not a duel, and your dean will definitely not punish you, after all, you are fighting for the honor of the academy.\"\n\"It's all fine.\" Truman was stunned, he had already believed it to half a degree, that's right, he beat you for honor, and when he was excited, he suddenly realized one thing, he would not disarm the spell.\n\"Come with me, I know what you need... a collection of self-defense spells.\" Albert led Truman in, \"You need to find someone to practice with you, don't look at me, I don't have that kind of free time, you can find someone Hufflepuff friends.\"\n\"Well, thank you, remember to come to the duel on the weekend.\" Truman grinned: \"On the lawn near the Black Lake.\"\n\"I will.\" Albert nodded and looked at Truman's back, his gaze fell on his task panel.\nEnthusiastic help\nYour friend Gabriel Truman seems to be having some trouble, and as your first wizard friend, you should help him out as much as possible.\nReward: 100 experience points, Gabriel Truman's favorability +10\ndistant victory\nYour friend doesn't have any advantage in the upcoming duel. As a friend, you should find a way to help him turn defeat into victory.\nReward: 1000 experience, randomly get a skill from the task target, Gabriel Truman's favorability +10.\nAlbert was a little interested in randomly obtaining a skill from the mission target. When he returned to his seat, Shanna, who had just finished her homework, asked curiously, \"What did you do just now?\"\n\"It's nothing. I just met a friend and chatted for a few words.\" Albert noticed that Mrs. Pince looked over, shut her mouth quickly, checked the homework she had just finished, and put him away.\n(End of this chapter)\n\n\n\n"
  },
  {
    "id": 104,
    "novel_id": 1,
    "title": "Daily Life at Hogwarts",
    "content": "\n\n\r\n\r\n\r\nChapter 104: Really Swollen Face\n\"Someone is fighting!\"\nOn the side of the hall, someone yelled, and the students who were having dinner all rushed towards the hall curiously, wanting to see what happened.\n\"What's going on?\" Albert took a homemade sandwich, followed the Weasley twins, and rushed to the entrance of the hall with the crowd.\n\"On the lawn near the Black Lake, Hufflepuffs and Ravenclaws are dueling.\"\nAll of a sudden, Albert figured out what happened.Truman's duel with Ravenclaw Prefect Notch brought forward?\nBy the time everyone ran towards the lawn, the duel between the two sides was over.\nRavenclaw's prefect, Noche, was knocked to the ground, and his face still had marks of being beaten. As the winner, Truman was standing in front of Noche, chanting something.\nWhen Albert and the others hurried over, the last scene they saw was Truman squatting down, stuffing a chocolate frog card into Noche's lips, and then, surrounded by several Hufflepuff students, with victory The gesture of the recipient left.\n\"What's going on, what happened exactly.\" Fred asked other people around him for news, and quickly figured out what happened.\nIn the duel, Truman took the first shot and used the Body Binding Curse to attack the Ravenclaw prefect. After succeeding, he put away his wand, raised his fist, and beat Noche severely, which swollen the opponent's face. up.\nBefore leaving, Truman also held a chocolate frog card and read a passage about Bridget Wenlock, and said that the famous thirteenth-century arithmetic fortune teller was from Hufflepuff.\nThe reason for the duel was quickly understood, as the debate over whether Bridget Wenlock had graduated from Hufflepuff or Ravenclaw ended in a duel.\n\"It's really refreshing, not all famous experts are from Ravenclaw!\" A senior Hufflepuff girl waved her fist fiercely to express her thoughts, \"Norch must know that Bridget Wenlock is from Ravenclaw!\" Hufflepuff, knowing that he was wrong and still not repenting, deserves to be beaten and swollen in the face.\"\nOf course, some people are talking about Truman's surprise attack.\n\"Nuo Qi is a prefect, and he is ashamed to fight a third-year student.\" Many people didn't pay much attention to Truman's surprise attack on Nuo Qi.\nAfter all, this duel itself is not equal, if you don't fight back, is it possible to stand up and get beaten?\nEspecially after knowing the reason of the incident, more people cheered excitedly when Truman swollen Noche's face.\n\"That bastard, despicable guy!\" Noche, who had been unbound by someone, got up from the ground in embarrassment and couldn't help yelling. The Ravenclaw prefect trembled with anger, and took out the Chocolate frog card, tear it to shreds at once.\nYes, it's not hard to see that Notch doesn't care if Bridget Wenlock graduates from Hufflepuff.His duel with Truman was only because of the correctness of others and the provocation of the other party many times.\nHowever, he was sneak attacked by the opponent, and he was beaten up by the opponent, his cheeks were swollen and painful.\nThe onlookers all knew why this guy was beaten, and the joking and gloating glances made Nuoqi even more angry.\nIf you make a mistake and refuse to admit it, and want to bully others because of your age, you deserve the beating, at least many people think so.\nBefore Nuoqi could vent his anger, he was taken away by Professor Flitwick who hurried over.\n\"It's so cool, this matter can be discussed for years.\" Fred looked very excited, as if he was saying why it wasn't me who went up to the duel!\n\"However, I'm even more curious. How did their duel come earlier?\" Albert ate the sandwich in his hand and said to himself, \"Truman told me that his duel with the Ravenclaw prefect was on the weekend.\"\n\"How do you know?\" The three of them looked at Albert in unison, with a bit of shock in their voices.\n\"The last time I met him in the library, Truman told me and invited me to watch the duel,\" Albert explained.\n\"You didn't tell us.\" George complained dissatisfied.\n\"Aren't there still a few days!\" When Albert and the others returned to the restaurant, everyone was talking about this matter, especially Truman's last behavior.\nAs for whether the two would be severely punished for solving the problem through a duel in private, no one would pay attention to this.\nAnyway, as long as the one who is punished is not himself.\nOn Friday night, Albert met Truman in the library. Perhaps this guy was waiting for him here specially.\n\"Notch was imprisoned for a week by Professor Flitwick.\" Truman happily announced the good news to Albert, \"I was supposed to be imprisoned for a week. However, Professor Sprout only gave a slight warning Me, and a box of coconut sorbet.\"\nAs he spoke, Truman took out two packaged coconut sorbets from the pocket of his robe and placed them in front of Albert, apparently intending to share this snack presented by Professor Sprout with Albert.\nWhen Truman talked about it, he looked very excited, so... he was finally kicked out of the library by Mrs. Pince with a feather duster.\nLooking at the back of Truman running away, Albert suddenly wanted to laugh.\nUnder Mrs. Pince's gaze, he immediately stuffed two pieces of coconut sorbet into his pocket, pretending nothing happened, and going on with his homework.\nHowever, Mrs. Pince did not seem to intend to let Albert go.\nIn the end, under the gaze of the librarian, Albert had no choice but to pack up his things and get out of the library.At least, not by a feather duster.\n\"Really.\" Albert stood in the corridor outside the library, took out a coconut sorbet from his pocket, unwrapped the wrapping paper, and took a small bite. It was very icy and had a strong coconut smell. Similar to the ice mice sold by Honeydukes, only not as icey, and... tastes good.\n\"What idea did you give him?\" Suddenly, a voice came from the side. Albert turned his head and saw a red-haired girl standing next to him.\n\"Good evening, Isobel.\" Albert greeted the red-haired girl, because they were actually acquainted with each other in the same club.\n\"Gabriel Truman claimed that he was just looking for Noch's theory.\" Isobel raised his eyebrows and said, \"However, it seems that you gave him the idea.\"\n\"Here, this stuff tastes good.\"\n\"Are you planning to bribe me?\" Isobel looked at a piece of coconut sorbet handed to him, his expression became very strange.\n\"If you insist.\" Albert didn't want to talk about this topic, but said with a smile: \"I just told Truman, never try to wake up someone who pretends to be asleep, unless you use your fist.\"\nAfter speaking, Albert turned and left.\n\"Unless you use your fists?\" Isobel stared at the coconut sorbet in front of him, slowly unwrapped the wrapping paper, put the coconut sorbet into his mouth, and walked towards the library after eating the pastry.\n(End of this chapter)\n\n\n\n"
  },
  {
    "id": 105,
    "novel_id": 1,
    "title": "Daily Life at Hogwarts",
    "content": "\n\n\r\n\r\n\r\nChapter 105 The expected wealth\nIn the Quidditch match at the end of November, the Hufflepuff team suffered a disastrous defeat in the snowstorm. Gryffindor and Ravenclaw are now competitors for the Academy Cup.\nIn order to win, Captain Charlie has been strengthening the intensity of Quidditch training, which makes the official players miserable. training.\n\"Charlie must be crazy!\" muttered Fred, looking out the window at the snow.\n\"He is just too eager to win the Quidditch trophy.\" Albert can understand Charlie's efforts, after all, it is the responsibility of the Quidditch captain. If even the captain relaxes, the Gryffindor team will probably never Neither got a chance to lift the trophy.\n\"Are you going home during the Christmas holidays?\" Li Qiaodan asked looking up after reading the letters from his home.\n\"Go back for the holidays.\" Fred and George looked at each other without thinking.\n\"I'll also go home for the festival.\" Albert looked at the potted plants by the window and asked, \"We've all gone back, what should we do with the things in the pots?\"\n\"Throw it here, and don't water it for a month, shouldn't it matter?\" George looked at the lush pot of garlic by the window, but his tone didn't have much confidence.\n\"Actually, you can make it when you go back, I mean... during the Christmas holiday.\" Albert tentatively talked about it.\nIn fact, Albert knew very well that several people had lost much enthusiasm for making garlic crosses.\nThere is no way, children's patience is always very limited, and Albert even wonders if they have already put this matter behind them.\n\"Oh, this matter!\" Fred and George looked at each other in blank dismay, and it seemed...it seemed that they had lost the enthusiasm they had before.\nSeveral people were even a little confused, not knowing why they had such great enthusiasm for making this kind of thing in the first place.\n\"Well, you can try it. However, we don't quite know how to make... garlic crosses. Do you really want to soak the crosses in smashed garlic?\" Fred asked tentatively, not sure he was so wasteful Will Garlic get his ass beaten by his mother with a broom.\n\"You can smash the garlic, soak it in alcohol, and then soak the cross in it.\" Albert has never practiced it, and the suggestions he can give to the two are very limited.\n\"That's a good idea. But...\" Fred paused angrily, as if he had forgotten what to say.\n\"However, we're not sure if we can get alcohol.\" George continued. It's hard for them to come across ordinary beer, let alone alcohol. It's very difficult to get it.\n\"What are you going to do with your pot of white meat?\" Li Qiaodan quickly changed the subject, his actual situation was not much better than that of the twins.\n\"Stay here, if you die, there's nothing you can do!\" The other potted plant by the window is the white fresh branch that Albert got from Hagrid. The branches are buried in the soil bag, and if you take care of them carefully, it is not too difficult to replant new Bai Xian.\nIt's just that white fresh is easily affected by the weather. If you don't transplant it in the greenhouse in winter, or find a warmer place, it will easily wither.\nIn fact, Albert didn't have much confidence in being able to feed this pot of fresh meat in winter.\n……\nAfter entering December, the weather gets colder and colder.\nAlthough the Gryffindor common room was burning with a roaring fire, the windy corridors became even colder due to the wind and snow.The glass of the windows was rattling by the bitter wind and snow, and everyone had to wrap themselves more tightly in their clothes.\nChristmas is approaching and everyone is looking forward to the holiday.\nHowever, professors subconsciously leave students with a pile of homework.\n\"It doesn't make people have a good Christmas holiday!\" Looking at the homework assignments on the parchment, Lee Jordan threw the quill on the table again.\n\"Acknowledge your fate, you have to do it anyway, or come back from the holidays, and let the professors take turns confining you.\" Albert put away the parchment, and had to admit that there were indeed a lot of homework during the Christmas holidays. Even he It cannot be completed in a short time.\n\"Don't mention it, you are a devil.\" Li Qiaodan leaned on the armchair.\nToday, students from the third year and above are all in Hogsmeade village, otherwise they would not have the opportunity to use the common room comfortably.\n\"Albert!\" George's words trembled a bit. He pointed to the front page news of the Daily Prophet and urged: \"Look at this, you guys, look at this!\"\n\"What's the matter?\" Fred asked feebly, \"What's the big news in the Daily Prophet?\"\n\"Millison Bagnor has decided to retire in February, and his successor has been determined to be Cornelius Fudge.\" George's breathing became very short.\n\"Cornnel Fudge?\" Fred repeated, his thoughts paused for a moment, and his voice suddenly raised eight points, \"You mean... Cornelius Fudge?\"\n\"What's the matter, is there something wrong with Cornelius Fudge?\" Lee Jordan looked at the twin brothers suspiciously, and suddenly came back to his senses, \"Wait, Cornelius Fudge seems to be...\"\nThe three of them turned their heads in unison, and looked at Albert with strange eyes. When they read this report, they suddenly remembered one thing. They met Albert on the Hogwarts Express... …\n\"I remember...\" George lisped\n\"...You seem to have spent 25 Galleons...\" Fred continued.\n\"Cornel Fudge will become the next Minister of Magic!\" Li Jordan's eyes gradually widened.\nAt this moment, the three of them opened their mouths wide open and looked at Albert in shock.\n\"I remember that it happened.\" Albert nodded and said, \"At the beginning, I asked you if you want to participate in the quiz together.\"\n\"My heart... hurts so much.\" Fred stretched out his hands to cover his chest, and his breathing became short of breath.If back then... watching Garen slip away from his hands, the feeling would have been too bad, it would have been heartbreaking...\n\"What are the odds for Cornelius Fudge?\" Lee Jordan asked suddenly.\n\"I remember it was like 4 times.\"\n\"25 Galleons is... 100 Galleons!\" Lee Jordan's breathing became heavier and heavier, like an old cow panting.\n\"100 Galleons.\" The twins murmured, their eyes glazed over.\n100 galleons, such a large amount of money, to a few people, they had never even thought about it.\n\"As I said, my luck is usually not too bad.\" Albert winked at the three of them and said, \"However, did the Daily Prophet mention when to give money?\"\n\"This... it shouldn't be too late. I think when Cornelius Fudge announces to take over as the next Minister of Magic, the guessing activity will be over. They should count it soon and give rewards to the winners .”\nAlbert nodded and said, there is no need to worry about running out of money recently.\nTo be honest, he doesn't like to ask his family for money to buy things. It's not a good feeling to ask someone for money.\n(End of this chapter)\n\n\n\n"
  },
  {
    "id": 106,
    "novel_id": 1,
    "title": "Daily Life at Hogwarts",
    "content": "\n\n\r\n\r\n\r\nChapter 106 Christmas Holiday\nAbout two weeks after the Daily Prophet announced that Cornelius Fudge would be the next Minister of Magic, the Daily Prophet's guessing rewards arrived by owl post.\nIt was still snowing outside, and owl postmen crowded into the auditorium as usual.\nAmong them, an owl threw the frosted envelope in front of Albert.A moment later, another owl threw a heavy animal skin bag on the table in front of Albert, and the dull metallic sound immediately attracted the attention of other people around.\nAlbert reached out to pick up the animal skin bag, weighed it twice, and after hearing the crisp sound inside, he guessed what was in the animal skin bag.\nHe didn't open the animal skin bag on the spot, but put it in his backpack.Then, he pulled out his wand and used a drying spell to remove the frost on the envelope, and then he opened the envelope and read the contents inside.\nThe letter reads:\nCongratulations, Mr. Albert Anderson.\nYou have won 100 Galleons in the \"Next Minister of Magic\" quiz, please sign for it. — Barnabas Guffey\nNote: Before signing, please do not open the animal skin bag, which is enchanted to ensure that Albert himself receives the galleon.\nInside the envelope, there was another piece of parchment, which was a magical contract to ensure that the money was signed by Albert himself.\nIf someone else tries to take money that does not belong to him from the animal skin bag, he will get into trouble. As for the trouble, the letter did not say, Albert guessed it might be some kind of curse, or some kind of tracking magic , allowing them to find the thief who stole the money.\nAlbert wanted to keep the secret as low-key as possible, but the secret always got out.\nNot long after, all the teachers and students in the school knew that he participated in the quiz activity of the Daily Prophet and won a large sum of Galleons.\nAs for how much?\nNo one knew the exact amount. Some said 50 Galleons, some said 100 Galleons, and some guessed 200 Galleons. In the end, George couldn't help telling the truth, which made a lot of people envious.\nEvery time someone talked about this matter, the tone was sour, it almost corroded a big hole in the ground.\n\"Now, everyone calls you \"Lucky Albert.\" Shanna sat in front of Albert, turned around and asked, \"How do you feel?\"\n\"Very good, I like this title, and I hope to continue to be lucky, maybe I can win the big prize again.\" Albert said with a smile.\n\"Now you can lie on the table and sleep for a while, maybe you can dream that you won the jackpot.\" Shanna couldn't help but rolled her eyes.\n\"My luck has always been good.\" Albert took out his wand, waved it in front of several people, and continued to fool: \"Mr. Ollivander told me that a wand made of red cedar can bring As luck would have it, my wand is made of redwood.\"\n\"Can redwood bring luck?\" Angelina looked suspicious, obviously not believing what she said.\n\"There is indeed such a saying. It is rumored that a wand made of red cedar wood can bring luck to the user, so this kind of wand is very popular among wizards.\" Katrina looked up and down Albert with strange eyes, \" Of course, there are those who think it's pure nonsense.\"\n\"Of course it's true. I guessed right with the help of my wand.\" Albert said with an expression that my wand could really bring luck.\nThe face of Lee Jordan next to him was twitching slightly. According to their memory, that was really the case.At that time, Albert just \"put the wand vertically on the table and let it fall to one side freely\", and then inexplicably decided to press 25 Galleons on Cornelius Fudge.\nWhen Fred told everyone about the situation at that time, everyone was dumbfounded, with a face like you are fucking kidding me.\nWhat kind of show operation is this? Is this the correct posture to win the big prize?\nHowever, this matter did not allow everyone to discuss it for too long, and the Christmas holiday has quietly approached.\nAfter packing his luggage, Albert took the school's Thestral carriage and walked along the snow-covered road to Hogsmeade's station.\n\"What are you doing?\" George asked puzzledly, and he saw Albert reaching out to the front of the carriage.\n\"Aren't you wondering what is pulling the carriage?\" Albert pointed to the snowy tunnel, \"Didn't you see the footprints on the snow?\"\n\"Is there something pulling the cart?\" All three looked shocked, but the footprints on the snow were the best evidence, invisible horses.\n\"Thestrals.\" Albert said softly, \"It is said that only those who have seen death can see thestrals.\"\n\"I've heard about these creatures, they are very unlucky.\" Li Qiaodan tried to pull Albert away from the Thestrals, and whispered, \"I heard that these creatures will bring terrible disasters to those who see them , is a bad omen.\"\n\"You think too much. Thestrals are a kind of flying horse. Its bad reputation is related to dead people. Otherwise, do you think Hogwarts would use them to pull carts?\" Albert couldn't help but give Li Jordan a white look, and pulled Put your own luggage into the express train, and prepare to find an empty compartment to rest.\nLooking at the leaping scenery outside the window, Albert was in a good mood.Along the way, a few people ate snacks and chatted about what to do during the Christmas holiday.\nWhen I'm bored, I also play Bibi's Adventure with Bean Flavor suggested by Fred.This game is to close your eyes, pick up a Bibi multi-flavored bean and put it in your mouth, and see who is unlucky enough to eat a strange flavor.\nLee Jordan was the most unlucky, he tasted like a piece of dirt, and he declared in front of everyone again that he would no longer eat Bibi's multi-flavored beans, which made everyone laugh.\nWhen the train started passing through Muggle towns, Albert took off his wizard cloak and put on a Muggle coat.Fortunately, Daisy carefully helped him prepare his coat, otherwise Albert would have really forgotten about it.\nIn the afternoon, the train finally stopped at King's Cross station.\nEveryone was about to leave platform 9 4/3, but they were stopped at the ticket gate by a wizened old guard who didn't allow too many people to pass at one time.\nA large number of people came out of the solid wall at the same time, attracting the attention of the Muggles.\nHowever, Hogwarts students still attract the attention of Muggles.\nWhen Albert had just stepped out of the wall, he found a man in unsuitable clothes standing by the wall, surrounded by several people from the Ministry of Magic.\nAmong them, there was actually one who used the illusion spell on himself. However, the technique of the illusion spell was not very good, and Albert vaguely captured his position.\nBefore mastering the illusion spell, Albert might not have noticed the other party, but he still has some understanding of the illusion spell now, and it is not too difficult to find a flaw.\n\"Goodbye, Albert!\"\n\"Goodbye, Albert!\"\nLi Qiaodan and Shanna waved goodbye to Albert.\n\"Goodbye.\" Albert also waved at them.\n\"He's there, Mom, Albert is there!\" Nia ran towards here while waving her hands.Albert waved to his family with a smile on his face, then turned to Fred and George and said, \"Goodbye, I'm leaving first!\"\n\"Goodbye, my family is here too.\" Fred pointed towards the distance, and Albert saw the red-haired Weasley family, as well as Fred's younger brother Ron and younger sister Ginny.\n\"What are you looking at?\" Nia complained dissatisfied.\n\"Okay, okay, I'll buy you snacks. But I'll bring them to you after I get in the car.\" Albert reached out and touched Nia's head, but the girl turned her head away.\n\"Don't touch the lady's head, it's very rude.\" Nia complained solemnly.\nHerb couldn't help laughing, reached out to take Albert's luggage and asked, \"How's life at Hogwarts?\"\n\"Not bad, I learned a lot of useful things.\" Albert said without thinking.\n\"Welcome home.\" Daisy smiled and handed Tom to Albert.\n\"It's getting heavier,\" said Albert, weighing Tom.\n\"A while ago, Tom stayed at his grandfather's house for a few days.\" Nia whispered, \"You also know the character of Sansa's grandmother.\"\nAlbert looked at his fat cat and sighed softly.After getting into the car, Albert put Tom on his lap, and while grooming him, he muttered, \"It's time to lose weight.\"\n(End of this chapter)\n\n\n\n"
  },
  {
    "id": 107,
    "novel_id": 1,
    "title": "Daily Life at Hogwarts",
    "content": "\n\n\r\n\r\n\r\nChapter 107 Christmas\nThe Anderson family's original Christmas holiday skiing plan was canceled. Luke and Sansa will come to spend Christmas together. No one in the family complained about it. They are not too enthusiastic about skiing itself.\nOn Christmas Eve, Albert saw Herb hovering outside Nia's door, seemingly considering whether to put a gift in front of his daughter's bedside table.\n\"Santa Claus is not popular now.\" Albert signaled Herb to put the Christmas presents downstairs next to the Christmas tree.\n\"I told him about this a long time ago.\" Daisy in pajamas looked helplessly at the two people in the corridor, and shook her head to remind, \"Go back to sleep quickly, don't stay up late, you have to get up in the morning to open the Christmas tree. What about presents?\"\nThe next day, Albert was woken up by Nia early in the morning.\nNo way, Tom's cat face was approaching his face, which made Albert sleepless all at once.\n\"I didn't find the Christmas present you gave me.\" Nia asked for it.\n\"Here it is, I haven't had time to put it next to the Christmas tree.\" Albert stretched out his hand to push Tom's face away, and after getting up, he took out a neatly wrapped box from the drawer and handed it to Nia.\n\"Where's mine?\" he asked.The two siblings have long given each other Christmas presents.\n\"Next to the Christmas tree downstairs.\" Nia unpacked the package, picked up the badge and asked, \"It's beautiful, by the way, what kind of bird is this?\"\n\"Phoenix, you can also call it a firebird or a phoenix. It is said that Headmaster Dumbledore raised one. However, I haven't seen a phoenix.\" Albert took out a small dried fish from the drawer and handed it to Tom said, \"And your Christmas present.\"\nAs he spoke, he tore off the wrapping paper, took out a small dried fish from inside, and shook it in front of Tom, easily attracting his attention.\nHowever, when Albert was about to put the dried fish into his mouth, Tom's face came closer and he meowed anxiously.\n\"This guy is too bad, Tom, we won't play with him anymore.\" Nia put the badge in her pocket, reached out to pick up the cat, took the bag of dried fish and went downstairs, leaving Albert alone , holding a small dried fish alone.\n\"White Christmas!\" Albert got out of bed and came to the window, stretched out his hand and opened the curtains, looking at the snowflakes falling outside, he said with emotion.\nWhen he went downstairs, Albert couldn't help but look under the Christmas tree, where there were still a bunch of small packages.Nia had already sat at the dining table and unwrapped her package, so...the rest are all her own?\nAlbert went under the Christmas tree and started unpacking:\nA few books, a few greeting cards, and a Quidditch poster, well, it was given by the Weasley brothers. Although Albert didn't know who the guys in this poster were, he planned to take it back to school. Posted in the dormitory, the poster should be the team that the twin brothers support.A small bag of candy, Albert looked at it, it was from Shanna, thanking him for his help when the school started.Lee Jordan gave him a box of Bee Beans.\nThere is also a Transformation Today magazine, but it is from the past. Albert looked at the sender, and it was actually sent by Professor McGonagall.\nAlbert is very curious, Professor McGonagall will also give himself a Christmas present?\nAnd then a scarf?\n\"How?\" Nia asked nervously, \"I chose this color.\"\n\"Very beautiful.\" Albert directly wrapped the scarf around his neck, it was still warm, off-white children's style, okay!He's only 12 years old, he's still a child, so there's nothing to complain about.\nThe rest were either candies or books. Albert was not surprised to receive the books, as it had been like this before.\nThe breakfast was extraordinarily rich, but the Anderson family didn't eat right away. Instead, they waited until Luke and Sansa came over. Around 10:30, the family of six enjoyed breakfast with Christmas carols. After they were full, they nestled on the sofa while watching TV. Show, while chatting about some light topics.\nNia originally hoped that Albert could perform magic, but Albert still did not agree after considering it.\nTo be honest, he still doesn't know what's going on with the Ministry of Magic's Zongsi. Although he asked other people, they don't quite know what Zongsi's principle is.\nNormally, the notice that the use of magic is prohibited outside the school should not be received until the summer vacation of the first grade.\nHowever, Albert does not want to take risks. It is undoubtedly unwise to take advantage of legal loopholes without preparation.\nAlthough he doesn't use magic, he can do a lot of things, play wizard chess, or chat about some interesting things.\nHowever, in terms of Wizard Chess, obviously no one is Albert's opponent.\nAfter Herb lost another game, he temporarily gave up playing wizard chess with his son.\nFortunately, Daisy brought out a large bowl of freshly fried chips from the kitchen at this time, giving him a good excuse to end the game.\n\"Tom, don't tease Sheila, be careful of being pecked.\" When Albert went to wash his hands, he took the short-haired cat away from the owl by the way, muttering: \"Did I choose the wrong name, it It should be called Jerry, Tom and Jerry, what a combination.\"\n\"Shera sounds better.\" Nia couldn't help reminding.\nAfter Albert came back after washing his hands, he heard a scream, and Tom with cheap claws was finally pecked hard by the owl.\nSheila obviously didn't intend to let Tom go, chasing after it and pecking fiercely, with full fighting power, Tom finally had to hide under the sofa in a panic.\nEveryone couldn't help laughing.\nSansa got Sheila some owl food, and then bent down, picked up Tom under the sofa, and soothed his wounded heart with small dried fish.\n\"Tom is getting fatter and fatter.\" Nia took out Albert's birthday present to herself for others to appreciate.\n\"It's nice for the cat to be fatter.\" Sansa smiled and scratched Tom's chin, \"Do you think it's Tom?\"\n\"When will it be able to fly?\" Nia raised her hand and poked the Gryphon, \"And, is there really such a creature in our world?\"\n\"Yes. However, it is said that they are all in unknown places.\" Albert was putting French fries dipped in ketchup into his mouth.\n\"The group of people in the wizarding world are like this, why hide like a mouse?\" Daisy sat next to Herb, and the two sat next to each other.\n\"After all, the number of wizards is small, and most ordinary people are afraid of power beyond their knowledge.\" It was Luke who answered.\nIn fact, many people fear magic while envious of others possessing magic, and then, for various reasons, regard magic people as monsters and find reasons to persecute them. Human beings are such creatures.\nTom was sprawled on the table, staring at the winged toy and poking it with his claws.\n\"Albert, have you read the book I picked for you?\" Daisy asked suddenly.\n\"I've finished reading it. It's a very good book.\" Albert nodded. \"Unfortunately, what's in the book is just what's in the book.\"\n(End of this chapter)\n\n\n\n"
  },
  {
    "id": 108,
    "novel_id": 1,
    "title": "Daily Life at Hogwarts",
    "content": "\n\n\r\n\r\n\r\nChapter 108 Magic Text\nHolidays are always enjoyable.\nThis is even more true for students.\nAlthough there are nasty holiday homework to be done, they can't affect Albert's good mood.\nIn fact, Albert had already cleared up the unfinished homework as quickly as possible the day before the Christmas holiday.\nA vacation without vacation homework is undeniably enjoyable.\nDuring the Christmas holidays, I could sleep until late in the morning, lie on the sofa after dinner and watch TV for a while.When you are bored, you can tease the cat, listen to music, chat with Nia, play chess, or sit by the fire and find a book to savor.\nHowever, just after Christmas, Albert found something of interest. After the library in the town reopened, he went to the library to find relevant records about the rune alphabet.\nThis incident stemmed from the fact that he bought a \"Simple Introduction to Ancient Runes\" a while ago, and it took him a lot of effort to finish the book. As a result, no skills related to ancient runes appeared on the skill panel.\nAlbert thought that this situation was similar to alchemy, so he decided to read more related books to deepen his knowledge of runes and master it.\nAs for waiting until the third grade to take the ancient magic text class?\nAlbert didn't have the patience to wait two and a half years.After all, he is a man with a panel. As long as the relevant skills appear on the panel, the follow-up questions will become very simple.\nThere are very few records about the rune alphabet in the library, but Albert still found relevant records in Germanic mythology:\nRunes, also known as runes, originated in Germanic mythology and are related to Odin, the famous father of the gods. It is said that Odin exchanged an eye for the knowledge of runes. (The word rune itself has a \"mysterious\" meaning)\nOdin belongs to the Germanic mythology, and the runes belong to the Germanic language. When it comes to Germanic people, the first thing Albert thinks of is the Germans.\nWell, that's right, they are the old-fashioned Germans, and German evolved from Germanic.\nHowever, there is a problem!\nAlbert still vaguely remembered that the author of Harry Potter used a lot of Latin when designing spells. However, Latin and Germanic belonged to two different languages.\nAlbert never thought of himself as an archaeologist, let alone a language expert, and he never thought of solving these problems that confused his mind.He chose to record his doubts. Maybe, the more knowledge he has about the runes, the doubts will be solved automatically.\nLater, Albert really found the connection between the two in the library: after the disappearance of the runes, the Germanic language also used part of the Latin alphabet.\nThis explains why Britain and Germany use the Latin alphabet, but are classified as Germanic.\nAfter several days of work, Albert understood a little bit why Hogwarts offered an elective course on Ancient Runes.\nGermanic mythology originated in Scandinavia, which is now Sweden.\nAccording to Albert's research on Germanic languages, the languages ​​of Denmark, Norway, and Iceland near Sweden are all derived from Germanic languages ​​and belong to North Germanic languages.\nOld English, on the other hand, is derived from the Anglo-Saxon Fortok, which belongs to the West Germanic language, that is, the runic alphabet.\nLater, a large number of Latin alphabets were introduced, as if related to religion.The whole of Europe was heavily influenced by Latin.Albert speculated that this might be one of the reasons why the runes disappeared.\nHowever, one thing cannot be denied is that runes have magical powers, and ancient magic items will be engraved with such ancient runes to enhance their magical power.\nAlbert believes that this stems from the rune stone, which was well-known in the wizarding world in his previous life.\nAlthough many things come from his own guesses, Albert still enjoys it. He is exploring these ancient texts, contacting them, and trying to learn to identify them and understand them.\nAfter Albert checked a lot of information, he found that the records in Muggles were very limited.\nFor this reason, Albert wrote a letter to ask Truman, and at the proposal of the other party, he bought \"Magic Word Phonetic Table\" and \"Magic Word Dictionary\" from Lihen Bookstore.\nCompared with the ordinary world, the magic world has a better understanding of runes. After all, this thing belongs to the mysterious side.\nIn the following holidays, Albert spent a lot of time trying to decipher the runes, which was a difficult task, but such attempts finally paid off, and finally appeared on his panel called \" Although the skill of \"Mowen\" is different from what he imagined, Albert still used the experience pool to upgrade this skill to level 1.\nSoon, he found that he could barely understand the runes. The feeling was very strange, and he could vaguely feel the magical charm of the ancient runes.\nAlbert continued to invest experience in \"Magic Words\". After directly upgrading to level 2, he found that he could read and understand most of the runes without the help of \"Magic Word Phonetic Table\" and \"Magic Word Dictionary\" , and be able to read them aloud.\nThis is a very interesting thing. The rune letters that Albert mastered with the help of the panel are undoubtedly correct, and when he re-reads the \"Magic Alphabet\" and \"Magic Dictionary\" through his own cognition, he will be able to Found some interesting bugs.\nWords are sometimes not necessarily able to be clearly and accurately described in another language, and errors are inevitable.\nEspecially those runic steles with religious overtones, most of the interpretations are actually somewhat wrong.\nA rune script is somewhat different in symbolic meaning, use of magic, function of runes and interpretation of divination.\nOnce these things are mixed up, the final result will be biased.\nAfter mastering the runes, Albert began to find faults, looking for those mistranslations, and recording them.\nLater, Albert began to try to design and study the use of runes in magic. The amulets that had been left behind before became the subject of Albert's latest research.However, before he could get the rune on the amulet right, the Christmas holiday was over.\nAlbert took the express train back to Hogwarts the day before school started.\nAs he expected, Fred and George didn't make garlic crosses, but they smuggled a bunch of garlic from home, and Lee Jordan was no exception.\nLooking at the garlic piled in front of him, Albert's eyelids twitched a little. He thought the three of them had forgotten about it.\n\"Have you finished your vacation homework?\" Albert changed the subject, he really didn't want to continue entangled in the garlic issue.\n\"Oh, there's one more thing.\" Lee Jordan said while eating pumpkin pie, \"I'll go to the library to look for materials later, and I'll make up for it soon.\"\n\"Our side is fine.\" The twin brothers said in unison.\n\"Copy each other?\" Albert saw through their tricks at a glance.\n\"No, it's called borrowing.\"\nLee Jordan snorted softly and continued to bury his head in his food.\n　Just look at this chapter.I am not an expert in this field, and my understanding of runes is limited. If there is a master, I can give you a popular science in the comments.If you are interested in this part of the information, you can also go to the group to read it, and I will post it after sorting it out.\n　　\n　\n(End of this chapter)\n\n\n\n"
  },
  {
    "id": 109,
    "novel_id": 1,
    "title": "Daily Life at Hogwarts",
    "content": "\n\n\r\n\r\n\r\nChapter 109\n\"Mister Weasleys, I need to remind you of one thing. The holiday assignments of the two of you are exactly the same except for a few differences.\"\nAfter class, Professor McGonagall stopped Fred and George and handed them back their vacation homework, \"Take it back and do it again. Next time, if a similar situation happens again, you will be locked up. You have to do homework yourself.\" Do it, don't keep trying to copy other people's.\"\n\"We all did it by ourselves, and we have the same mind. It can only be said that there is a tacit understanding.\" The twins looked at each other and argued in unison.\nProfessor McGonagall was taken aback when he heard the words, and he didn't expect the tacit understanding between the twins to be so high. He couldn't help but looked up and down the two, nodded and said: \"Okay, forget it this time, if there is a next time, I will go to confinement.\"\nSeeing the back of Professor McGonagall leaving, the twins clapped happily and winked at Lee Jordan and Albert.\n\"Actually, Professor McGonagall has seen through your tricks a long time ago. I believe Snape will not let you go easily.\" Albert reminded.\nHis words were quickly fulfilled.The twins' rhetoric could not send Snape away. The potions professor just stared at them coldly, and then said, \"Take it back and redo it.\"\n\"At least Snape gave you a chance.\" Lee Jordan patted Fred on the shoulder gloatingly and said, \"You know, that's Snape. You're lucky enough not to be locked up.\"\n\"I think Snape can see through our thoughts.\" George said suddenly.\n\"Don't look directly into Snape's eyes, it's easy to be seen through.\" Albert reminded, \"It's definitely a kind of magic, although I haven't figured out what kind of magic it is yet.\"\n\"Magic?\" The three of them looked at each other, but they still believed it.\n\"In the near future, I plan to...\" Albert raised his hand and made a walking gesture, \"I need to pass through the rope on the fifth floor of the castle.\"\n\"When are you going to...\" Fred's eyes lit up. They knew that Albert had already mastered the Disillusionment Charm. With this kind of nocturnal weapon, there was basically no need to worry about being caught by Filch.\n\"Recently.\" Albert stopped, raised his hand to catch the object flying here, and opened it to see that it was a piece of chalk.\n\"Good afternoon, Peeves!\" Albert raised his wand and bounced all the chalk boxes thrown by Peeves.\nPeeves made a face at them, and then planned to throw something in this direction.\n\"This is for you...\"\nAs he spoke, Albert threw the chalk back. The chalk passed through Peeves' head and hit the wall behind.The latter made a rude gesture towards them, turned and floated away.\n\"It's a good place.\" Fred said in a low voice, \"I've always wanted to go in and have a look. It is said that the books placed there are somewhat dangerous.\"\n\"What are you talking about?\" Lee Jordan didn't follow the train of thought of the few people, and looked at them suspiciously.\n\"Library, rope,\" George reminded.\n\"You mean...\" Li Qiaodan was stunned. Before he finished speaking, the three of them glared at him and swallowed the words back.\n\"Just know it yourself.\" Albert patted him on the shoulder and said.\n\"However, the things there are still too advanced for us.\" Li Qiaodan also knows how much he has, so he didn't think about it because he couldn't learn it at all.\n\"The magic in the past is a bit dangerous for people today.\" Albert said disapprovingly: \"In ancient times, wizards were almost unrestrained, and the magic created and used at that time was the product of no scruples. Many spells now seem to be messy, and when they were recorded, they were not standardized, let alone easy to understand.\"\nIt is difficult to understand the meaning of those ancient books without research, and some are still written in ancient magic script.That's why Hogwarts put those books in the restricted area, so that students won't be fooled after reading them and trying to use them.\nBut Albert is different, he has a panel!\nAs long as he reads the book, he can successfully master all the spells that can appear on the panel through the experience pool.\nIt is actually necessary to expand the diversity of magic.\n\"Your words remind me of Open Sesame.\" Fred remembered the incident when Albert knocked down the door of Professor McGonagall's office.\n\"I checked this spell later. Before Alahoo Cave was opened, people used the \"Door Open\" and then \"Open Sesame\".\" Under the interested eyes of the three, Albert continued: \"This A spell, like a rude visitor, kicks down the door of someone else's house, opening the door as desired.\"\n\"In comparison, the current Alahoo hole is indeed more refined, which is also one of the characteristics of contemporary spells.\"\n\"It's unbelievable.\" Li Qiaodan was stunned.\n\"This spell is so...cool.\" The twins' eyes sparkled eagerly.\nAfter lunch, the Weasley twins had to go to the library. They had more homework than the others, and if they didn't finish it in time, they really risked being locked up by Snape.\nFor the two of them, this was simply a nightmare, and no matter what, they couldn't let it happen.\n\"What strange things are you studying again?\" Lee Jordan glanced at Albert's parchment after finishing his homework. There were many strange symbols on it, but he couldn't understand them anyway.\n\"Rune symbol.\" Albert pointed to the three intersecting lines on the top, which is a bit like a rice character with a horizontal line missing and a slanted one on the right. \"This symbolizes wealth. It is said that making it into an amulet can increase a person's wealth.\"\n\"I think your fortune is good enough.\" Lee Jordan whispered.\n\"No one would mind that their fortune is better.\" Albert said lightly.\n\"Is this thing useful?\" The twins who were busy doing their homework moved their heads together, \"We need some luck recently.\"\n\"Then you need some Felicity Elixir,\" Albert said.\n\"what is that?\"\n\"Lucky water, it is said that drinking it can make people have good luck for a period of time.\"\n\"And this thing?\" The twins felt incredible.\n\"Yes, but it is said that it will take several months to prepare this potion.\"\n\"A few months!\" George couldn't help raising his voice.After being stared at by a group of people, he quickly retracted his neck, pretending to be a little transparent.\n\"The configuration of Felicia is very difficult. If you make a mistake, it will become poison.\" Albert said in a low voice.\n\"how do you know?\"\n\"The last time I was doing Snape's homework, I found it when I was looking for information, and then I looked it up again when I was interested, but unfortunately I didn't find the formula for Felicia.\" Albert explained casually.\n\"I'm even more curious, are the things you made effective?\" Field had been watching for a long time, and suddenly asked at this moment.\n\"I'm sure it won't work.\" Albert couldn't help but rolled his eyes, \"The rune you've been looking at just now is to increase the charm of boys.\"\n\"Oh, where is it that adds charm to girls?\" Field asked casually.In fact, Field has also studied ancient runes. Although she only got an E in the exam, she can still feel that Albert has a lot of attainments in this area.\nWhat the hell, how on earth did he master this knowledge.\nThose complicated runes were not easy to draw, and she had to look at them for a long time, and she barely discerned them through the annotations on the parchment.\n\"Oh, no. After all, I'm a man.\" Albert said as a matter of course, \"If these runes are effective, I will definitely use them for myself first.\"\n(End of this chapter)\n\n\n\n"
  },
  {
    "id": 11,
    "novel_id": 1,
    "title": "Daily Life at Hogwarts",
    "content": "\n\n\r\n\r\n\r\nChapter 11\n\"Sir?\" Truman exclaimed, taking a deep breath. \"You just left?\"\n\"What's the matter?\" Nutley looked at Truman suspiciously.\n\"In other words, am I okay?\" Truman was dissatisfied with the attitude of the Ministry of Magic.\n\"Yes, it was a total mistake.\" Nutley's tone was formulaic.\nTruman glanced at Albert next to him and said coldly, \"I need an apology, Mr. Apology, do you know how much this letter has affected me? The risk of expulsion, how angry you are saying it's okay now, like dismissing me, do you think a child is easy to bully, sir?\"\nTruman's tone got tougher, and it really pissed him off that the Ministry of Magic was going to leave with a slap on the butt.Not long ago, Albert gave him the advance work, and the slightly trembling tone gradually became tough, \"I need an apology from the Ministry of Magic, this matter is entirely caused by your mistakes, and I have nothing to do with it. Relationship, and...the Ministry of Magic must compensate me for my mental damages.\" In fact, if the Ministry of Magic apologized to him, Truman would not ask for any mental damages, but the other party's actions really made him feel extremely annoyed and angry.\n\"What, I didn't hear clearly.\" Nutley's expression froze, and even the expression on Dumbledore's face became very exciting.\n\"Sorry, and Mr. Mental Loss Fee.\" Truman clenched his fists, \"100 Galleons.\"\n\"Sorry child, I'm sorry to cause you trouble, but the mental damage fee... has never been a precedent.\" Nutley couldn't help raising his eyebrows.\n\"I don't accept your apology, sir. You are not sincere.\" Truman said angrily, \"You think I can be bullied just because I am a child?\"\nNutley and Dumbledore looked at each other.\n\"I think it's reasonable gentlemen, I was there, and when Truman pounced on me after reading the letter, I even suspected he was going mad. It took me a long time to calm him down and offer him to give Deng Principal Bledo writes a letter.\" Albert looked at the two in front of him calmly, without any fear.Honestly, he didn't like the Ministry of Magic, at least when he was reading the novels, and more so when he saw how the Ministry of Magic handled it.\nMake such a big mistake, at least give a sincere apology!Asshole, pat on the butt and leave.\nSpeaking of clothes, they are just a group of guys who use their powers. No wonder Voldemort makes them into such a ghost.\n\"Also, I also think your apology is insincere.\" Albert narrowed his eyes and said, \"I haven't seen an adult like you. One of my teachers is such a guy.\"\nNutley's face darkened at once.\n\"Of course, you can just treat us as children.\" Albert suddenly smiled, stretched out his hand and patted Truman on the shoulder and said, \"Some people, that's how it is, don't pay too much attention to it, go back, I'm a little hungry, pass by another day Owl contact, maybe we can chat about study issues.\"\nNutley left, leaving with a black face, he had no idea what he was going to face.\n\"Then goodbye, Headmaster.\" Albert nodded slightly towards Dumbledore, \"Thank you very much for helping Truman solve this trouble. If he is expelled because of me, I will feel guilty for it.\"\n\"Goodbye Mr. Anderson, and Mr. Truman.\" Headmaster Dumbledore also left.\n\"Those guys are so annoying,\" Truman said, clenching his fists. \"What kind of attitude is that, so annoying, I want to punch him hard.\"\n\"How about it, do you want to write to the Daily Prophet?\" Albert smiled and looked at Truman after Dumbledore left.\nJust now, Albert triggered a mission called \"Truman's dissatisfaction\", which is one of the reasons why he decided to help the other party.\n\"Yes, it must be exposed.\"\n\"Remember to give half of the reward to me.\" Albert was not afraid of making trouble at all. The reward for this task was very rich, with 3000 experience points and an additional 25 Galleons.\n\"Okay, you write. By the way, are your family members really lawyers?\" Truman couldn't help asking.\n\"Of course, they're lawyers, so I'm actually pretty good at that, not to mention, we're right, society sympathizes with the underdog, and people would love to see a Ministry of Magic scandal in the Daily Prophet, and talk to reporters when the time comes. Just keep our names and pictures out of the papers, and put away that letter from the Ministry of Magic.\"\nAlbert knew there was a guy who was perfect for the job.\n……\nRita Skeeter ponders today's special issue at the Daily Prophet headquarters in London, England.Lately, there's been no major news to write about, and it's been a little bit nerve-racking for her.\nPeople like to read big news, whether it is true or exaggerated, as long as a newspaper can catch the attention of readers, in Rita Skeeter's opinion, it is a successful newspaper.\nShe is asking her assistant, trying to find some more topical news.\nBefore long, several letters were placed on Rita Skeeter's desk.She opened the envelope. There were some who scolded her and some who gave her gossip. However, one letter successfully caught Rita Skeeter's attention. After reading the letter, Rita Skeeter knew that It was the news she wanted, because there was a photo attached to it.\nA few days later, the Ministry of Magic's Division Against Abuse of Magic became famous.In the Daily Prophet, he was described by Rita Skeeter as a department that always made own mistakes, and refused to apologise for his mistakes, with a very bad attitude in handling problems.\nNutley was also singled out, and this unfortunate fellow became the target of countless criticisms.\nRita Skeeter wrote at the end of the article that the victim expressed doubts about whether the Ministry of Magic was still trustworthy, and he disclosed the incident to the Daily Prophet and asked for 50 Galleons as a spirit that the Ministry of Magic was unwilling to pay. compensate.That's more than the cost should have been paid by the Ministry of Magic, and they owe the kid a sincere apology. \"\nAfter seeing the newspaper, Nutley suddenly felt that the original decision was really bad. He remembered what the boy said: Do you think a child is easy to bully, sir? \"\nHowever, the other party proved with facts that he was not easy to bully.\nNot long after the newspaper came out, it immediately caused a sensation.\nNutley was forced to temporarily leave without pay, because the Department of Improper Misuse of Magic suffered, and many people sent letters there.\nRita Skeeter used her pen to tell everyone what the lethal power of words is. After getting the dictation and description of the two people, the reporter skillfully used these words to fabricate what she expected, and by the way The Ministry of Magic is messed up.\nShe was not worried at all that the content was not credible, because it also attached the content of the letter from the Ministry of Magic Prohibition of Abuse of Magic.\nTruman was in a very happy mood, and he received 25 Galleons as spiritual compensation, which was a wealth he could not imagine at all.\nMoreover, the female reporter did not reveal his and Albert's names. It was just as Albert had guessed. The Daily Prophet took this incident as a headline, and slammed the Ministry of Magic. The guy is out of luck.\nAlbert is also in a good mood. His mission has been completed, and he has gained Truman's friendship. They often communicated through owls during the summer vacation, and the other party could help him with magic.\nAs for the allocated Galleon, Albert used it to order the Daily Prophet.\n(End of this chapter)\n\n\n\n"
  },
  {
    "id": 110,
    "novel_id": 1,
    "title": "Daily Life at Hogwarts",
    "content": "\n\n\r\n\r\n\r\nChapter 110 That was really an accident\n\"That...you know that one just now?\" George looked up at Field's leaving figure and muttered softly.\n\"A friend I met at the Transfiguration Club.\" Albert said without looking up: \"Field is very good at Transfiguration, and it is said that he has published an article in \"Transformation Today\". After graduation, he should also go to the field of Transfiguration Let's develop!\"\nIn fact, students who are eligible to be selected into the Transfiguration Club by Professor McGonagall will basically publish articles in \"Transfiguration Today\", a magazine that has a few pages dedicated to Hogwarts students who are particularly good at transfiguration of.\n\"Do you know where your job will be after being good at transfiguration, professor of transfiguration?\" Lee Jordan interrupted and asked.\n\"do not know.\"\n\"In fact, after graduation, girls usually don't work for too long because they need to take care of their families.\" Fred whispered: \"This is the norm. Of course, there are some exceptions.\"\n\"Is that so?\" Albert blinked, he was not very clear about things in the wizarding world.\nHowever, there is one thing that Albert is very clear about. Full-time mothers in the UK are considered a \"profession\", and their status is several blocks away from their previous lives.\n\"Yes.\" George nodded in agreement, as was the case with his family.\n\"This is the case in my family.\" Shanna whispered. \"What about your house?\"\n\"They are all lawyers,\" Albert replied.\n\"Who's taking care of you?\" Shanna asked curiously, having also done her homework.\nNow, every time they encounter homework that needs to find information, they are used to going to the library together, then looking for information together, and sharing the information they find.\nAs for how to write a thesis, that is their own business. Usually, they can always finish their homework quickly, because they don't need to spend a lot of time looking for information.\nThis tradition was started by Albert, who thought it saves time and effort, everyone likes it, and there is an atmosphere when doing homework.\n\"I can take care of myself.\" Albert said naturally.\nSeveral people looked at Albert with astonishment, but they thought of Albert's formal style.This guy doesn't seem to be the type that needs to be taken care of by others.\n\"You...\" Shanna paused, changed the subject, and pointed at the symbol of good luck on the parchment, \"This kind of thing is really useful, so you didn't draw it randomly, did you?\"\n\"This is the rune \"gibu auja\", which means good luck.\" Albert explained in a low voice, \"The ancient wizards would make it into amulets or \"good luck stones\" to bring good luck to themselves. transport.\"\n\"I think you're lucky enough.\" Shanna whispered.\n\"So do I,\" muttered Fred.\n\"Is this kind of thing really useful?\" Shanna actually noticed that the senior student just now was very interested in these symbols and seemed to know what they were.\n\"I'm not sure, but why don't you try it yourself.\" Albert said.\n\"How?\" Shanna asked.\n\"Engrave this symbol on a stone or a tree. After the engraving, you have to drip your own blood on the engraving, so that it will be effective.\" Albert winked at her and said: \"If it works, it will be effective.\" , Remember to tell me, when the time comes, I will sell all kinds of amulets at Hogwarts, and I will definitely make a lot of money.\"\n\"Remember to pick me up.\" George said immediately.\nHearing this, several people couldn't help rolling their eyes.\nIn fact, they also knew what Albert said, and they were mostly joking.As for whether the pile of symbols on the parchment has any effect, no one knows.\n\"You haven't tried it yourself?\" Fred looked like he didn't expect you to be such a person.\n\"Isn't this still under study?\"\nIn fact, Albert is still studying it, but his words sound a bit like quibbling.\n\"Then you are going to put the symbol on the amulet?\" George thought of the cross made by Albert, which was originally an amulet.\n\"No, I'll redesign one.\" Albert shook his head. He also knew that George and the others didn't believe in these things, but he didn't care about their doubts. If he didn't have a vague intuition, he wouldn't believe it himself.\nAlthough Albert has mastered the reading and writing of ancient runes, how to use them and how to draw out the mysteries of the runes still needs to be explored by himself.\nNow, the only thing Albert can do is to record this research process on parchment, which will give him a feeling of researching magic.\nWhen you really succeed in the future, you can make these parchments into a book:\nLook, this is the autographed manuscript left by the XX wizard studying the runes, the legendary XX wizard's handbook, etc. It feels very interesting.\nOne day, a certain Hogwarts student solved the mystery left by Albert and found his \"treasure\" hidden in Hogwarts, which is actually quite interesting.\nMaybe, I can use these manuscripts to write a book about ancient magic text in the future, and maybe it can be used as a textbook for Hogwarts' ancient magic text class.\nHmm, that seems like a good idea.\nJust as this thought flashed through Albert's mind, there was another movement in the panel task.\nMagician expert.\nYou are already ahead of most people in the field of runes. In order to further prove your authority in this area, write a book related to ancient runes and make it a textbook for Hogwarts ancient runes class.\nReward: 10000 experience, 1 skill point, title: rune expert, reputation in the magic world +300.\nAfter reading the task panel, Albert was shocked immediately. He wondered if he would trigger the corresponding task as long as he wanted to become an expert in a certain field?\nAfter having this kind of guess, Albert immediately tried it, but the other panel tasks did not appear as he expected, which made him a little disappointed.\nAlthough it may not be possible to complete, as long as the task appears, it means there is a certain possibility. Moreover, even if it cannot be completed now, it may not be impossible in the future. Maybe I will really write a book about magic text. No one can tell what the future holds.\n\"What are you thinking, come here quickly.\" Fred stopped and shouted to Albert behind him.\n\"It's nothing, I was thinking that I should go to bed early today.\" Albert suddenly said, \"After all, if you have to get up early at night...\"\nHe stopped suddenly. He noticed Fred's quiet movements. Before he looked in the direction of his fingers, a strange voice rang in his ears, \"You want to get up early at night? Why do you get up early at night?\"\nFilch was standing not far away, obviously heard Albert's words, and took it as a provocation, so he walked towards this side, fixed his eyes on Albert and said, \"It's best Don't let me know that you are in the middle of the night...\"\n\"Ahem...\" Albert looked at them helplessly, and couldn't help but roll his eyes.\n\"How could it be such a coincidence.\" Albert whispered after Filch left.\n\"Filch must have thought you were teasing him.\" Fred couldn't help himself from laughing out loud. It was indeed a coincidence just now, when the few people were about to turn the corner, who knew that Filch would suddenly appear come out?\n\"You all know that this is just a small accident.\" Albert looked innocent, expressing that he really didn't intend to tease Filch.\n\"Of course we know.\" The three said in unison.\n(End of this chapter)\n\n\n\n"
  },
  {
    "id": 111,
    "novel_id": 1,
    "title": "Daily Life at Hogwarts",
    "content": "\n\n\r\n\r\n\r\nChapter 111: Exchange Secrets\nIn the early morning, Albert just woke up from a light sleep, and the surroundings were pitch black. He couldn't be sure what time it was, but he could clearly feel the shallow breathing of other roommates around him.\nAlbert quietly got off the bed and was about to change his clothes when a familiar voice suddenly sounded in his ear.\n\"We thought you'd sleep through the night.\"\n\"So, George, you lost.\" Fred sat on the edge of the bed and looked at his twin brother with a smile. \"I said a long time ago that Albert will definitely wake up.\"\n\"Okay, you won.\" George nodded a little depressed.\n\"Good evening.\" Albert put on a sweater for himself, looked at the two roommates and asked, \"Together?\"\n\"of course.\"\n\"Unfortunately, Lee Jordan really fell asleep!\"\n\"What should I do, should I wake him up?\"\nThe two lighted their wands, raised them to the other bed, looked at the roommate who was breathing evenly, shook their heads together and said: \"Give up, I can't wake up!\"\n\"Then don't wake him up.\" Albert was putting on thick clothes on himself, wrapped the towel that Nia gave him around his neck, and reminded him casually: \"It's cold at night, dress well Clothes, lest you catch a cold!\"\n\"We have been prepared for a long time.\" This is not the first time for the twins to travel at night, and they have more experience than Albert.\nThe three of them went downstairs quietly. The Gryffindor common room was already empty, and the fire had already been extinguished.\n\"Shall I give you the illusion spell now?\" Albert briefly adjusted his winter cloak, then raised his wand and said to the twins beside him: \"Wait a minute, follow closely when you go out, don't lose gone.\"\n\"Where are you going?\" Fred asked curiously, \"The restricted area?\"\n\"Yes, I'm going to borrow some books there.\" Albert didn't deny his peeking at the restricted area, and said in a low voice, \"The Book of Spells, and...\"Powerful Potion\", or other potion books , I'm actually very interested in Felix Elixir. I'm sure you can find relevant records in the Restricted Section.\"\n\"Are you planning to make lucky water?\" The twins looked at each other and said in unison.\n\"It's still a bit difficult now, but it will definitely be possible in the future. I am confident in my potion level.\" Albert has a skill panel, so he is naturally confident.\nFelicia is a good thing, he will not give up easily.\n\"Could it be that you plan to make a fortune selling Felicia in the future?\" The twins looked at each other, \"I dare say it will be very popular. When the time comes, remember to bring us along and make a fortune together.\"\n\"That's a good idea. A small bite should be able to sell for 20 Galleons, or even more.\" Albert murmured, \"The potions of the two of you are in a mess, and the potions you get can only be poison.\"\n\"a small bit!\"\n\"Twenty Galleons!\"\nThe twins' tone rose instantly, as if they heard something unbelievable, and completely ignored the second half of Albert's sentence.\n\"The value of Felix Elixir is indeed very high, but its brewing is also very difficult, and the process is very complicated. It is said that only a skilled potion master can brew it. \"Time.\" Albert reminded, \"However, brewing it is very complicated. Once you make a mistake, the consequences will be disastrous. Even a master can't guarantee success in brewing it. Failure means half a year of hard work. Float.\"\nIn fact, Albert knew that the Elixir of Felicia could not bring real \"good luck\", but he needed the effect of the potion, and drinking it was equivalent to adding a powerful buff to himself.\nTo some extent, everything goes well is also a kind of \"good luck\".\nThe most important thing is that he has a skill panel and an experience pool. If he masters the skills first, he can transform himself into an expert in brewing Blessing Elixir in an instant.\nThe Felicity Potion undoubtedly aroused the interest of the twins. The potion that can make people good luck can also be sold for a large sum of money. If they really master it, it means getting rich. Although they don't specifically pursue wealth, they are also very clear. What it feels like to be poor.\nNo one wants to be poor if they can be rich.\n\"Okay, I'm going to use the illusion spell.\" Albert looked at the two and asked, \"Who will come first.\"\n\"No, you don't need to use the Disillusionment Charm, we have a better way.\"\n\"A better way?\" Albert naturally knew what they meant by a better way, but he should pretend that he didn't know anything at this time.\n\"Use this.\" The twins pulled out an old piece of parchment from their pockets like a magic trick, and waved it in front of Albert like offering a treasure.\n\"What is this?\" Albert lowered his voice, deliberately making his tone sound suspicious, so as not to reveal any flaws. He didn't know about the Marauder's Map.\nIn fact, the surroundings were very dim, and Fred and George would not notice the expression on Albert's face.\n\"Map, remember the good things we both got from Filch's \"Confiscated Materials, Highly Dangerous\" drawer?\" Fred reminded.\n\"Oh, this is what you got from Filch, an old parchment?\" Albert raised his wand and moved to the old parchment, there was nothing on it.\n\"Invisibility magic, or invisible ink?\"\n\"This is a map, a Hogwarts map. It requires a special password to use. But, you are right, it can hide the information inside.\" George raised his wand and clicked on the map, muttering: \"I solemnly I swear I did nothing wrong.\"\n\"Didn't do anything good?\" Albert felt a little like laughing, but still nodded seriously: \"It's true that I didn't do anything good.\"\nChanges appeared on the map very quickly, and countless inks and interlaced lines outlined a map of the castle.\n\"It's really a wonderful map, and it's not hard to see the creator's good intentions.\" Albert said softly, \"There is also very advanced tracking magic on it.\"\n\"What magic?\" George asked puzzled.\n\"Tracking magic.\" Albert explained. \"The creator used tracking magic on the map, and his attainments are not low.\"\n\"Yeah, he will mark the location of everyone in the castle.\" Fred winked at Albert and said, \"Just after twelve o'clock, Filch really got up and patrolled around, trying to catch It's a pity that you are stuck...you were still asleep at the time, so he made a trip for nothing.\"\n\"So...you know that the locations of those secret passages are also related to this map?\" Albert asked with narrowed eyes.\n\"Yes, it is indeed known from the Marauder's Map.\" The twin brothers whispered: \"Don't tell Lee Jordan about this for the time being.\"\n\"I know.\" Albert expressed his understanding, \"However, I think there are some secrets in the school, you must not know.\"\n\"What secret?\" the twins said in unison.\n\"The broom cabinet you were looking for earlier.\" Albert said mysteriously.\n\"Did you find the broom cupboard?\"\n\"That's not a broom closet, follow me.\" Albert smiled mysteriously, \"You will be surprised later.\"\n(End of this chapter)\n\n\n\n"
  },
  {
    "id": 112,
    "novel_id": 1,
    "title": "Daily Life at Hogwarts",
    "content": "\n\n\r\n\r\n\r\nChapter 112 Who is here\nThe three of them pushed away the portrait of the fat lady and climbed out from the hole.\n\"Who is it? It's time to go out.\" The fat lady opened her dim eyes, swept away the three leaving shadows, and muttered dissatisfied.\nThe three of Albert didn't say a word, they walked quickly in the corridor, towards the corridor where the tapestry where the troll club beat silly Barnabas was located.\n\"Is this the place you said?\" George asked in a low voice, looking at the wall opposite the tapestry.\n\"Yes, it's right here. You need to concentrate on thinking about the venue you need, and walk through that wall three times, and a door will appear on the wall.\" Albert motioned the twins to stand aside, and then began to concentrate and prepare Open the entrance to the Room of Requirement.\nHowever, when he passed the wall three times, he found that there was no door on the wall.\n\"No door?\" Fred and George looked at Albert suspiciously.\nAlbert looked at the wall opposite the tapestry, and fell into a brief silence. Before the twins could speak again, he stretched out his hand and pushed them, signaling everyone to leave here quickly.\n\"what happened?\"\nAfter the three of them walked forward for a certain distance, Fred stopped and asked puzzledly, \"Is it you...\"\n\"There are people inside, there are people in the Room of Response.\" Albert said affirmatively, \"Only when there are already people inside, we can't open the door from the outside, unless you can guess the room where the people inside are.\"\n\"Are you sure it's not the way you opened it wrong.\" George asked suspiciously.\n\"Impossible, I've gone in several times.\" Albert shook his head and said, \"Besides, I don't need to deceive you, it's pointless to do so.\"\nThe twins looked at each other in blank dismay, thinking that Albert didn't need to be joking at this time, and the other party didn't seem to be joking either.\n\"Who do you think is in there?\" George asked curiously.\n\"I don't know, it's very likely that it's a couple. After all, it's very suitable for couples to date, and no one comes to bother you.\" Albert said casually, \"However, there should be very few people who know this place.\"\n\"Why?\" Fred asked puzzled.\n\"Are you willing to share your secrets with too many people?\" George couldn't help rolling his eyes.\n\"That's right.\" Albert nodded. \"The Room of Requirement is a magical place. It will provide you with whatever place you need.\"\n\"Is it really so miraculous?\" The two said in unison.\n\"Otherwise?\" Albert whispered, \"Let's try again at another time. Of course, if you don't believe me, just think I'm lying to you.\"\n\"Why don't you believe me?\" Fred said, \"It will be our secret base from now on.\"\n\"Have you figured out how to use it?\" Albert asked back.\n\"No.\" George thought for a while, \"At least, when we go out at night, we don't need to worry about being left outside the lounge overnight.\"\n\"See, that's all you've got.\" Fred said contemptuously.\n\"What about you?\" Albert asked back.\n\"I... haven't figured it out yet,\" Fred muttered.\n\"You have the nerve to talk about me.\" George said contemptuously.\n\"What about you?\" Both of them looked at Albert.\n\"Me?\" Albert paused, \"In the future, you can come here to brew potions, practice magic, find a quiet place to do your homework, or make something.\"\n\"And you can find a urinal here when you hold back your urine.\"\n\"On a date, too.\"\n\"Say, do you have a girl you like, and you are going to abandon George.\" Albert asked righteously.\n\"Why do you make it sound like I've been abandoned by someone?\" George was speechless.\n\"Stop making trouble.\" Fred couldn't help but rolled his eyes, and changed the subject: \"We'll take you to other places first, we know a lot of hidden secret passages, let's go to the library later!\"\n\"Well, that's a good idea.\" Albert nodded in agreement with the twins' proposal, and could take the opportunity to increase the progress of exploring Hogwarts.\nAs for who is using the Room of Requirement, Albert does not think it is a certain couple. Although this possibility cannot be ruled out, he has other thoughts in his mind.\nWho is the most suspicious at Hogwarts?\nThe answer is undoubtedly the Defense Against the Dark Arts professor.\nAlthough Bud Broad made a good impression on Albert, who made every Defense Against the Dark Arts professor at Hogwarts suspicious:\nFrom Voldemort's minion, writer and part-time liar, werewolf, fake ex-Auror undercover, the Ministry of Magic toad who deliberately seeks trouble, Mr. Double Agent, to the last Death Eater brother and sister.\nIn fact, Albert doubted Professor Broad because they had met Professor Broad here.\nCould it be another minion of Voldemort or something?\nAlbert started to fantasize, but quickly got rid of this idea.\nIf they were Death Eaters, few would be willing to talk to a Muggle wizard.After all, it's an indisputable fact that Death Eaters hate Muggle wizards.\n\"This way...\" Fred led the way, and the three stopped in front of the knight statue, and they showed Albert how to use the password to open the secret passage.\nFor most of the next time, the three of them wandered around the castle.Albert is very satisfied with the current exploration progress. After George showed him the secret passage leading to the outside of the castle, he couldn't help wondering whether Sirius Black sneaked into the castle through this secret passage a few years later.\n\"Peeves is on the third floor, do you think we should use it to wake up Filch?\" Fred suddenly suggested when he stopped to look at the map, \"It must be interesting to let Filch get up and look for us. , he should have just slept not long ago.\"\nBoth of them looked at Albert, waiting for his opinion.\n\"Okay, but where are you going to hide? Don't tell me, you're going to play hide-and-seek with Filch in the castle.\" Albert agreed.\n\"We can create some trouble for Filch, and with your Disillusionment Charm, he won't be able to catch us.\" Fred took out a bag of dung bombs from his pocket and winked at Albert , it seems that this guy came prepared.\n\"Okay, what are you going to do.\"\n\"You go invisible first, then watch mine.\" Fred disappeared in a blink of an eye.\n\"Come on!\" Albert raised his wand and tapped George's head lightly. The latter trembled and was surprised to find that his body merged with the surroundings.\n\"It's so cool.\" George said excitedly after checking his body with the Luminous Charm, \"I dare say, even if he stood under Filch's nose, he would definitely not be able to catch me.\"\n\"It's best not to take any risks. My Disillusionment Charm isn't very good.\" Alberto reminded himself after using the Disillusionment Curse. \"If Filch carefully identifies it, he can still find it.\"\nThe two had just exchanged a few words when they heard Peeves yelling from the other side of the corridor, \"The students don't sleep and wander around in the middle of the night.\"\n\"Last time, during our night tour, we met Peeves. That guy did that at the beginning.\" George winked at Albert and said.However, he forgot that he had the illusion spell on his body, and others couldn't see the expression on his face at all.\nSoon, Fred ran over in a hurry, was grabbed by George, and dragged into the secret passage behind the portrait.\n\"It's so cool, I didn't even notice you.\" Fred looked at the bodies of the two and said excitedly, \"Albert, quickly use the Disillusionment Charm on me.\"\n(End of this chapter)\n\n\n\n"
  },
  {
    "id": 113,
    "novel_id": 1,
    "title": "Daily Life at Hogwarts",
    "content": "\n\n\r\n\r\n\r\nChapter 113 Was Discovered\n\"The illusion spell should last for a few hours, or it may be shorter. Anyway, the effect will gradually disappear. You should pay attention to the changes in your body.\" When Albert used the illusion spell on Fred, he reminded, \"If the spell If you are invalid and get caught, don’t confess me.”\n\"I have confidence in you. After all, you dare to use it for yourself.\" Fred didn't take this matter to heart. In his opinion, Albert dared to use it for himself, which meant that the effect of the spell was guaranteed.\n\"Filch was indeed woken up. He has already woken up and is ready to arrest people.\" George, who had been staring at the Marauder's Map, noticed that Filch had started to move, and immediately reminded him.\n\"Have you found any other professors?\" Albert asked.I still have a task related to Filch on my side. If Filch is the only one, Albert doesn't mind completing the task at all.\n\"I haven't found it so far. Filch should search the third floor first. Let's go to the fourth floor and make some noise there. Then...\"\nAfter the three got together and chattered, they began to act according to the original plan.\nIn the corridor on the third floor, Filch, who was wearing a thick cloak, was in an extremely bad mood, because he found that he was out of the air again. Those students who woke up in the middle of the night for night tours went somewhere, and even Peeves disappeared.\nFilch regained his composure quickly, for he heard the sound of hurried footsteps, and the sound was very close.\nThat guy is still around, he can't escape.\nGritting his teeth, Filch chased after him, and when he passed the corner, he even saw the light disappearing around the corner.\n\"You can't run away.\" Filch muttered, and chased after him with the oil lamp.\nHowever, Filch, who was chasing after him, found that he had lost his target.\nThat's right, lost it!\nFilch dared to pat his chest to assure that there was absolutely no secret passage nearby. Where was that damned guy hiding?\n\"What is this?\" Filch had just walked a few steps forward when he felt that he had stepped on something. He moved his foot and poked the lamp over. His face immediately darkened.\nI stepped on a big dung bomb!\nFilch raised his head furiously, held up the oil lamp and scanned the surroundings, looking for the bastard who played tricks on him.\nHowever, Filch didn't realize at all that the person he was looking for was squatting in the corner of the corridor, trying to hold his breath, trying not to let himself laugh out loud.\nThere is no doubt that Albert's Disillusionment Charm successfully helped Fred hide from Filch's eyes.\nFilch didn't stay where he was for long, because he heard the clang of armor falling from upstairs again.\nThe guy ran upstairs?\nIs there a secret passage nearby that he doesn't know about?\n\"impossible.\"\nFilch thought that no one knew the secrets of Hogwarts better than himself.\nAngrily, he hurriedly chased in the direction of the sound, still muttering in a low voice, \"You can't escape, I will definitely hang you up and beat you hard with a whip.\"\nAfter Filch's footsteps faded away, Fred opened his mouth and gasped, feeling as if he was suffocating.\nFilch passed through the secret passage as fast as he could and rushed to the armor corridor on the fourth floor. He only found a helmet dropped on the ground.\nThe sound just now came from it falling.\nAs Filch walked past, he smelled the familiar stench again.\nThat's right, the smell of a dung bomb. A dung bomb landed on his boots. As soon as Filch realized it, he chased straight ahead.\nHe already knew that he was being tricked.\nThose pesky students, or Peeves?\n\"Peeves, get out of here, I know you're up to something, get out of here!\" Filch blushed, looking like a volcano that was about to erupt, and Fred, who was hiding beside him, looked excitedly. Looking at the direction in which Filch disappeared, it never occurred to him that he could still blame Peeves for this matter.\nThis is a good thing.\nAnyway, neither side is a good thing, it would be best if they could pinch each other.\nIn another corridor, Albert closed his pocket watch and used magic to make a crackling sound after estimating the time. Just as he was about to leave the crime scene, he suddenly heard hurried footsteps approaching this side.\n\"Oops.\"\nAlbert quickly held his breath and hid in a corner.\nA few seconds later, a pale light appeared in Albert's field of vision, and Professor Bud Brod, wearing a purple cloak, walked towards him.He raised his wand and looked around, his eyes lingering for a moment on where Albert was hiding.\n\"It's over.\" Albert felt his heart beat a few beats faster, and he was not sure whether his Disillusionment Charm could fool Professor Brod.\nFilch also rushed towards this side.\n\"Professor, did you hear anything?\" Filch said angrily. \"There are students on the night tour. I think they are more than one of them.\"\nAlbert smelled a stench, and he swore it was the twins who had thrown the dung bomb at Filch.\n\"Is there a student on a night tour?\" Professor Brod raised his eyebrows, glanced at Albert's position, and said, \"I didn't see it. I just came to check when I heard the sound. What happened to your boots?\" What's going on?\"\n\"The big dung bomb is probably made by Peeves, that guy is invisible.\" Filch explained angrily.\n\"Peves?\" repeated Professor Broad meaningfully, and with a flick of his wand, he wiped the stain off Filch's boots.\n\"Thank you,\" Filch said gratefully.\n\"You're welcome. You go there to look for it, and I'll go over there to have a look. If the student made the noise, he must not have gone far.\" Professor Brod pointed in another direction.\n\"Okay, we must catch them tonight.\" Filch turned around and chased around the corner, and Professor Brod also turned and left.\nAlbert vaguely heard Brod's voice: \"This is not an example.\"\nAlbert didn't think it was an illusion, Professor Brod really found him.However, the professor actually let him go, which surprised Albert.\nAfter the two left, Albert left with a pinched hand and went to the agreed place to meet the twin brothers.\nSpeaking of which, why did Professor Broad suddenly appear?\nCould it be that he was really the one who entered the Room of Requirement?\nAlbert didn't think about it any more. After getting rid of other thoughts in his mind, he carefully went to the meeting place.\n\"Are you okay?\" George asked worriedly. \"I just found out that Professor Brod has also appeared. Didn't he see through your disillusionment spell?\"\n\"No, he has seen through it. But he let me go.\" Albert said helplessly, \"Let Fred come back quickly, let's go to the eighth floor.\"\n\"What are you doing on the eighth floor?\" George asked puzzled.\n\"Go to the Room of Requirement, you should be able to enter there, if possible, hide there for a while, wait for Filch to go back to rest, and then go to the library.\" Albert wanted to make sure that the people in the Room of Requirement just now, Is it Professor Broad?\n\"Okay.\" George also knew that this was the end of the night, and it was not good to make too much noise.\n\"Where did you and Fred agree to meet?\"\n\"He's coming soon,\" said George.\n\"Albert, are you okay?\" Fred, who was going to lure him away, hurried over and asked worriedly.\n\"It's okay, let's get out of here first.\" Albert interrupted, \"Filch is still looking for us. Of course, there is also Professor Brod. The Disillusionment Curse cannot be hidden from his eyes.\"\n(End of this chapter)\n\n\n\n"
  },
  {
    "id": 114,
    "novel_id": 1,
    "title": "Daily Life at Hogwarts",
    "content": "\n\n\r\n\r\n\r\nChapter 114 Albert's Little Trick\nThe three quickly transferred through the secret passage, and it took a while to reach the eighth floor.\nAfter listening to Albert's narration, Fred gasped slightly and felt incredible, \"So, Professor Broad didn't help Filch catch you.\"\n\"Albert is an excellent student in the eyes of the professors.\" George joked, and then opened his mouth wide in surprise, because there was actually a door on the wall opposite the tapestry where the troll club hit silly Barnabas.\n\"Sure enough...\" Albert whispered softly.\n\"So what?\" Fred asked curiously.\n\"It's nothing, let's go in!\" Albert pushed open the door and walked into the Room of Response first.\n\"I didn't expect it to be true.\" Fred and George looked at each other, and walked in behind Albert. Their mouths were all big, and what caught their eyes was a beautifully arranged house that had never been seen before. A room with...\nThe excited expressions on the faces of the two couldn't help froze, and they looked at the various exquisite and luxurious potties in front of them in astonishment.\nAlbert looked at the astonished expression on Brother Weasley's face, blinked mischievously and said, \"How about it, are you surprised?\"\n\"Could it be that you discovered it by accident when you came here with a very full bladder?\" Fred couldn't help asking.\n\"How is it possible, am I that stupid?\" Albert couldn't help but rolled his eyes.\n\"This is really the broom cabinet we discovered earlier?\" George looked curiously at the luxurious potty here, and suddenly realized an idea, and asked, \"So, are you in a hurry?\"\nThe three couldn't help laughing, and each picked a style they liked.\n\"However, it feels a bit strange that we really have to hide here.\" Fred scratched his head and said.After all, no one likes hiding in a pile of potties.\n\"It's nothing, just go out and change to another room.\" Albert said casually.\n\"This place is not within the range of the Marauder's Map. Maybe Prongs, Moon Face, Wormtail, and Padfoot haven't discovered the secret here.\" George said, looking at the Marauder's Map in his hand.\n\"Prongs, Moon Face, Wormtail, Padfoot?\" Albert asked pretending to be puzzled.\n\"The maker of the Marauder's Map,\" Fred explained.\n\"Oh, they.\" Albert nodded. \"Maybe they didn't find out. After all, few people know the secret of the Room of Requirement.\"\n\"No problem, Filch is still on the fifth floor.\" George said after checking the Marauder's Map.\nAfter the three left the Room of Requirement, Fred asked, \"What's going to change?\"\n\"A place to rest.\" Albert suggested.\n\"I'm here this time.\"\n\"I also want.\"\nThe twins put their hands on each other's shoulders, and after another try, the door opened, and this time, they emerged in a cozy room with a roaring fire.\n\"Great.\" Fred patted the armchair. \"By the way, you haven't said how you found this place.\"\n\"I want to know, too,\" George agreed.\n\"This is the result of my analysis from you. Did you pass by here many times at that time? Did you still want to find a hiding place?\" Speaking up, what he said was true.\n\"That's right.\"\n\"So, I took the time to try, passed by here many times, and then wanted a place to hide.\" Albert explained.\n\"What happened?\" George asked.\n\"Of course it failed. I tried many times before I finally opened this door, and after sorting it out, I figured out the correct way to open it.\" Albert began to exaggerate the difficulty of finding it here.In fact, he succeeded on the first try.\n\"Later, I tested to turn this room into another room. After trying many times, I found out the correct way to use it.\" Albert blinked and said, \"So, later I called this room the Room of Response. Because of this The room will be changed into various rooms according to your needs, and it will be responsive to your needs, isn’t it very appropriate.”\n\"So, you found this place through these clues?\"\n\"That's right, I found this place through the clues you provided, am I amazing?\" Albert nodded and said, \"Praise me if you want!\"\n\"You...\" The twins swallowed back the words they were about to say, but they still admired each other very much. They didn't expect Albert to find this kind of place just relying on this clue.\n\"When we make garlic crosses, we can do it here.\" George said suddenly. In this way, we don't need to worry about making the dormitory full of garlic smell.\n\"Haven't you given up yet?\" Albert thought they had forgotten about it, but he didn't expect to bring it up again at this time.\n\"Why give up, we already have enough garlic.\" Fred nodded, \"This is the first alchemy item we made.\"\nAlbert couldn't help wiping the cold sweat off his forehead. He didn't know if he was going to tell them that it wasn't really an alchemy item.\nBut...he was really embarrassed to speak, to shatter the bad dreams of the teenagers.\nAfter all, the two are the men who will become the king of jokes in the future.\nThe three of them rested in the Room of Requirement for a long time, waiting for Filch and Professor Broad to give up hunting them.Compared to Filch, who was searching for them, the twins were sitting by the fireplace, fighting Albert.\nThere were two wizard chess games in front of their table, and Albert easily dealt with the two of them with a [-]v[-].\n\"Fred, work harder, you still have a chance to turn defeat into victory.\" George encouraged loudly.\n\"How do you add it? By the way, you actually lost earlier than me.\" Fred couldn't help rolling his eyes when he looked at the brother sitting next to him who was making sarcastic remarks. He knew that he was about to lose.\n\"Ahem.\" George coughed dryly, and quickly changed the subject, \"Filch seems to have gone back to rest, let's go to the library.\"\n\"That's a good idea, let's go.\" Fred immediately stood up, ready to abandon the game.\n\"Uh, okay.\" Albert didn't pierce the opponent's mind, but just moved the queen to checkmate Fred's king.\n\"You lost too.\" George patted Fred on the shoulder gloatingly and said, \"You are much better than our useless brother.\"\n\"Brother?\" Albert asked puzzled, \"The unlucky guy whose tongue was burned through the candy.\"\n\"Ahem, it was just an accident.\" George coughed dryly, and walked out of the Room of Requirement quickly.\nThe three walked towards the school library.\nThe Hogwarts library will be closed at eight o'clock in the evening. To the surprise of the three, the library door is not locked.\nAlbert opened the door and walked in first.The hall was dark and eerie.\nAlbert raised his wand, looked around with the light of the wand, and then walked towards the restricted area behind the library.\nAfter crossing the rope that isolated the restricted area, the surrounding atmosphere became even more gloomy.\nAlbert raised his wand and read the name of the title with the help of the pale light.\n\"Help me find the \"Book of Spells\". And don't open those books casually, and don't take them off the shelf. No one knows whether these books have been cursed.\" Albert warned: \"Remember Hold on, don't open the book, it might cause us a lot of trouble.\"\n\"Understood.\" The twins looked at each other, but nodded.\nIt is undoubtedly a waste of time to find the books you need in the sea of ​​books. Albert spent a long time, but he couldn't find what he needed.\nThe books in the restricted section all looked very worn out, and Albert was a little skeptical if there were a lot of orphaned copies stored here.\n\"Albert!\" Fred's voice was very low, \"I heard faint whispers coming from some books over there.\"\n\"Whisper?\" Albert frowned. Hearing what the twins said, those who didn't know thought that Voldemort's Horcrux was hidden in the restricted area.\nThe three of them leaned over together, pointing their wands at the peeling and faded gilt letters, they all felt the hairs on the back of their necks stand on end, and they could all hear the whispers coming from the books.\n\"This is a restricted area. It's not surprising that there is such a book. Don't open it.\" Albert warned, \"It must be a recorder's book on black magic.\"\n\"Do you think there are powerful black magic records in it?\" The twins looked at the book with a bit of awe.\n\"Maybe, I don't know.\" Albert warned. \"But I'm sure, if you open it now at this time, you will definitely be unlucky.\"\n\"You're right.\" Fred gave up the idea of ​​dying, worried that there would be some bad black magic in the book, after all, some bad things would happen after reading some books.\n\"Toadstool Tales\" and \"Wizard's Sonnets\" are the best examples. The former will make people sick and vomit, and the latter will make people only speak in doggerel for a lifetime.\n\"Help me find the \"Book of Spells\", the spells in it are more suitable for us to study now.\" Albert reminded again.\nFred and George both nodded and agreed to help. They also wanted to learn some jinxes, and the powerful jinxes in the \"Book of Spells\" were obviously suitable for them to practice.\n\"Looking separately will be more efficient. As long as you don't touch the books casually, you will be fine.\" Albert reminded, and continued to look for the books he needed.\nThere are a lot of books stored in the restricted area. When Albert passed through an area, he vaguely heard someone communicating in a low voice.\nAlbert immediately held his breath and listened attentively. He could vaguely hear the sound coming from a bookshelf next to him, but it wasn't the books on the shelves in front of him, but somewhere else.\nThere seemed to be something here, but it was hidden by magic.\n\"It's weird...\" Albert muttered, he didn't try to uncover the secret, but continued to look for the books he needed, which was the purpose of coming here.\nIt took about an hour or even longer, and the three of them basically walked around the restricted area before finally finding the books they needed.\n\"I knew the books here were not so easy to take away.\" Fred pointed to the chains on the books and said, \"What should I do? The Alahoo Cave won't work, these chains must be enchanted.\"\n\"Don't you intend to forcefully break the chain?\" Neither George nor Fred wanted Albert to do that, and he was worried that doing so might lead to bad consequences.\n\"Of course I won't do that kind of stupid thing. It's expected that there will be an anti-alahoo hole spell on it.\" Albert took out a small knife from his pocket.\nThis pocket knife was something he bought for Christmas.What Albert wanted was not this knife, but some universal accessories on the knife.Among them, there is a tool used to unlock the lock.He had already practiced at home, and it wasn't too difficult to open such an old lock.\n\"What are you going to do.\" Neither of them understood why Albert suddenly took out a knife.\n\"Using Muggle tricks.\"\n\"A Muggle trick?\" Both of them were curious about what Albert was going to do.\n\"All of you keep your eyes open and watch carefully.\" Albert began to fiddle with the lock on the book.\nAfter a while, there was only a light click, and the lock on the book was opened at once.\n\"How on earth did you do it.\" The twins looked at Albert in surprise.\n\"As I said, this is the lockpicking trick of Muggles.\" Albert shook the knife in his hand and said: \"Most wizards will ignore some tricks of Muggles, although it is not as good as the lockpicking spell, and the speed is also slow.\" A little bit, but they tend to ignore it, so I have a loophole to exploit.\"\nAlthough Hogwarts casts spells on these locks, and even breaking the chain by force may cause an alarm, he believes that using a key to open the lock will never have any side effects, because this is the correct way to open it.\nAlthough Albert didn't have a key, there was obviously no problem using Muggle lockpicking.\n\"Next time you have a chance, be sure to teach us this technique.\" The twins' eyes flickered, and he felt that the way Albert used was very useful.\nMost wizards always despise Muggles because they don't know magic, which gives Albert a loophole to exploit. Even Hogwarts obviously ignores this.\n\"This kind of lockpicking technique is easy to learn. I will teach you if I have the opportunity.\" Albert said casually.Whether the twins could learn it, he didn't know.\nBy the time they left the library, it was already four o'clock in the morning, and the three of them held tonight's trophies in their hands, the original \"Book of Spells\", \"Book of Potions\" and \"Power Potion\".\nAfter repeatedly confirming that no one was there, the three quietly left the crime scene and returned to the Gryffindor common room, avoiding a ghost wizard with a cane on the way.\nWhen he returned to the dormitory, Lee Jordan had already woken up, looking dissatisfied at the three who had just returned from a night tour.\n\"You should have woken me up,\" Lee Jordan complained.\n\"Who made you sleep like a pig.\" Fred held up today's booty to show off to Lee Jordan, \"We got it from the library.\"\n\"Let me see what books are there.\" Lee Jordan asked curiously.\n\"Look for yourself, don't break it, let's sleep for a while.\" Fred suppressed a yawn, began to take off his clothes, and prepared to go back to sleep. He had never slept like Albert before. , After the excitement of the night tour, I really want to sleep now.\n\"Good night.\"\n\"Good night\"\n\"Three bastards.\" Looking at the three of them lying back on the bed again, Lee Jordan cursed in a low voice, and turned his attention back to the three brick books they brought back.\n(End of this chapter)\n\n\n\n"
  },
  {
    "id": 115,
    "novel_id": 1,
    "title": "Daily Life at Hogwarts",
    "content": "\n\n\r\n\r\n\r\nChapter 115 Obstruction Spell\nAt present, Mrs. Pince has not noticed the collection of books in the restricted area, and someone has quietly \"borrowed\" three books.\nAlbert is more concerned about this matter. Every time he goes to the library to do homework, he will pay special attention to whether there are rumors of missing books in the library.\nIn fact, Albert was too worried.Books in the Restricted Section are chained to shelves, and librarians don't spend all day checking to see if there are any missing books in the Restricted Section.\nAfter all, the chains used in the restricted area are protected by magic, and they cannot be opened or broken by ordinary students. Some people may go to the restricted area to read books in the middle of the night, but it is not easy to steal the books in the restricted area.\nCompared with this matter that Albert cares about, another interesting thing has been spread in Hogwarts.\nIt was said that when a certain student woke up in the middle of the night for a night tour, he played around with Filch, who was patrolling at night.\nThe administrator Mr. has been gloomy in recent days.\nWell, that's the look on Filch's face most of the time.\nThe rumor started when a student, who happened to pass by Filch, heard him whispering:\nI will definitely catch you, I will hang you up and whip... and whispers like that.\nCombined with the previous case, everyone quickly concluded that Filch failed to catch the students who woke up in the middle of the night for night tours.\nFor Hogwarts students who are eager to find interesting topics, this is undoubtedly an interesting thing.\nSome students quickly made up their own minds and made this matter known throughout Hogwarts.\nHowever, the rumors they weaved are very in line with the actual situation.\nAfter being bombarded by gossip, every time the administrator stood in the corridor, he would stare aggressively at every passing student, trying to find the guy who woke up in the middle of the night for night tours.\nFilch's hideous appearance failed to catch the culprit, but frightened the lower grade students enough.\nMr. Administrator is completely unaware that the culprit who caused all this is currently having a snowball fight with someone outside the castle.\nGeorge looked at the snowball stagnant in mid-air, and said in surprise, \"Have you successfully mastered the Obstacle Curse?\"\n\"Well, I learned it not long ago.\" Albert said, \"This magic is actually not too difficult.\"\nFred scoffed at this, one of Albert's lies: this magic is actually not too difficult.\n\"It's not easy to use magic to accurately hit a moving object.\" Li Qiaodan poked the snowball in mid-air, turned his head to look at Albert, and asked curiously: \"Are you accurate?\" How did you practice it?\"\n\"Be careful.\" Albert reminded.\n\"Be careful of what?\"\nAs soon as he finished speaking, before Lee Jordan could react, his face was smeared by Snowball.\n\"I reminded you.\" Albert spread his hands and explained innocently, \"Although the Obstacle Spell can suspend the target hit by the Spell, the effect will not last for too long.\"\nOf course, if the wizard who uses it is malicious, it can also have the effect of repelling the enemy, which is related to the wizard's own magical power.\nHahaha!\nThe three of them couldn't help laughing when they saw this scene.\nThe next moment, George, who was still laughing, was hit in the face by a snowball, and part of the snow fell into his mouth.\nGeorge wiped the snow off his face and backhanded Lee Jordan with a snowball.\n\"I dare say that few of the freshmen know how to use the Obstacle Charm.\" When Lee Jordan threw the snowball at George, Fred also threw the snowball in his hand at Albert.\nFred's sneak attack was unsuccessful, and the snowball was held in mid-air by a blue-green spark. It was as if someone had pressed the pause button.\n\"The effect is not bad.\" Albert stretched out his hand and pushed the snowball aside. The next second, the snowball hit the snow beside him.\n\"Snowball fights don't involve using magic.\" Fred couldn't help protesting loudly, \"You're cheating, can you still have fun playing here?\"\nFred is very envious of Albert's speed of learning magic, they are all learning the obstacle spell.However, unfortunately, except for Albert, no one else has succeeded in mastering the Obstacle Curse so far.\nThere are many things that need to be learned at ordinary times. If you want to master a magic, you need to spend a lot of time to practice.\nEspecially in the first grade, everyone's magic power is still in a period of continuous growth, and someone like Albert who can quickly master magic seems to be cheating.\n\"Well, I don't use magic.\" Albert put his wand in his pocket, bent down and squeezed out a snowball from the thick snowdrift on the ground, and stuck it directly on Fred's face who was still about to speak.\n\"Let me finish,\" Fred could not help protesting.Then, while speaking, he was hit by another snowball, this time by Lee Jordan.\n\"You want to use snowballs to practice the Obstacle Curse?\" Albert raised his eyebrows and said first, \"That's a good idea.\"\n\"I……\"\nThis time, before Fred could speak, George next to him interrupted him with a snowball.\n\"You three bastards,\" Fred yelled angrily.\n\"Which one of you will come first?\" Albert asked, ignoring Fred's protest.\n\"He first.\" George and Lee Jordan raised their fingers to Fred.\n\"Fred, get ready.\" Albert bent down and pinched a snowball, and shouted at Fred, \"I'm going to throw it.\"\n\"What preparation?\" Fred was still a little dazed, and was hit in the face by another snowball.\n\"Of course it's practicing the Obstacle Curse!\" Albert blinked and said, \"This is a rare opportunity.\"\n\"Yes, this is a rare and good opportunity.\" Li Qiaodan and George nodded in agreement, \"We even gave you the best opportunity.\"\n\"Bastard, I don't want this kind of opportunity, whoever gets out first will get smashed.\" Fred glared at the three of them angrily.\n\"He.\" Both of them pointed at Albert.\n\"No, it's just you, George.\" Fred was very dissatisfied that his brother was clearly on the same team as him, but he still threw stones at him.\n\"Okay, I'll just be me.\" George accepted the reality straightforwardly, but he said again, \"However, let's talk about it first, everyone will try ten times, no one is allowed to hide, and they can only block the snowball with an obstacle spell.\" .”\n\"I have no objection.\" Albert said bluntly.\n\"Of course you have no objection...\"\nAs a result, it was conceivable that none of the three could use the obstacle spell to block the oncoming snowballs, and were hit by snowballs one after another. This group of guys especially liked to greet others in the face.\nLee Jordan wiped off the snow on his face, pointed to Albert and complained, \"The three of us go together.\"\n\"Who told you not to use the Obstacle Curse?\" Albert waved his wand, easily fixed the three flying snowballs, and moved a step to the side, letting the three snowballs fall into the air.\n\"What the hell are you doing?\" Shanna, who was passing by, happened to be hit by three snowballs.\n\"It's all Albert's fault, who made him avoid it.\" Lee Jordan took the lead in pinning the blame on Albert.\n\"Yes, yes.\" Fred and George agreed.\n\"Hit them with snowballs, or I'll help you.\" Albert enthusiastically offered to offer help.\n\"Ahem, Shanna, do you want to have a snowball fight together?\" Fred finally smeared a snowball on Albert's face when Albert was not paying attention.\n\"Albert is too cunning to use magic to block snowballs during a snowball fight.\" George said nonsense seriously.\nAlbert couldn't help but rolled his eyes at the twin brothers, and muttered, \"Actually, we're practicing magic.\"\n\"What magic?\" Shanna asked curiously.\n\"The Obstacle Curse.\" Albert said without hesitation, \"You bastards still want to sneak attack me.\"\n\"Didn't I give you a chance to use the blocking spell?\" George quibbled.\n\"Would you like to practice together?\" Fred invited with a smile, \"This spell is quite interesting.\"\n\"No, I'm going to go skating by the lake.\" Shanna pointed to the skating boots in her hand, \"I brought them from home when I went home last Christmas holiday.\n\"Skates?\" Albert raised his wand, stopped the snowball that George was trying to attack him, and said to Shanna, \"Are you alone?\"\n\"Angelina and the others don't know how to play this thing. You know, the only sport that many wizards like is Quidditch.\" Shanna said helplessly, \"By the way, can you skate?\"\n\"Yes, yes. However, my level in this area is very average.\" Albert said casually, \"However, I thought you didn't like sports.\"\n\"It's too rude to say such things.\" Shanna raised her eyebrows and said, \"I've been playing with this throughout the Christmas holiday, do you guys want to go together?\"\n\"Interesting?\" Fred asked curiously.\n\"I personally think it's quite interesting. There are also many people skating on the side of the Black Lake.\" Shanna nodded in the direction of the Black Lake and continued.\n\"Let's go and have a look.\" George was a little interested in skating.\n\"You don't have roller skates, so why join in the fun?\" Albert couldn't help but rolled his eyes at the three of them.\nIce skating is not easy to learn. Generally, beginners want to learn by themselves, and they have to break their ass. Moreover, ice skates are quite dangerous and very unfriendly to beginners.\n\"Isn't there still you?\" Lee Jordan stretched out his hand to give Albert a hand. \"When the time comes, you can use transfiguration to make a pair of shoes. I believe you can do it.\"\n\"Transfiguration is more difficult to conjure that kind of shoes.\" George denied Lee Jordan's approach. \"You should ask someone to borrow the skate boots, and then use the duplication spell to help us get the boots.\"\nAlbert was dumbfounded when he heard this, the people around him are all talents!\n(End of this chapter)\n\n\n\n"
  },
  {
    "id": 116,
    "novel_id": 1,
    "title": "Daily Life at Hogwarts",
    "content": "\n\n\r\n\r\n\r\nChapter 116 McDoug\nAs George said, it wasn't too difficult to get a pair of skates.\nAlbert asked Shannah to borrow skates, and then used the copy spell on it to easily get the skates used by four people.\nAlthough the skates used by Shanna are general-purpose, Lee Jordan’s feet are too big to wear Shanna’s skates, so he can only stand on the shore helplessly, watching other roommates put on skates and prepare to try This is a new sport.\n\"Be careful with the skates, don't slip, and don't hurt yourself.\" Albert looked at Fred and George who had put on their skates, and reminded loudly, \"It's best for you to separate and practice in a place where no one is around. \"\n\"Is there really no way to help me change the size?\" Lee Jordan was a little depressed, feeling uncomfortable being left behind.\n\"You ask someone else to borrow a pair of skates, and I'll make a copy for you.\" Albert put on the brown boots, turned them back, and began to get familiar with the feeling of skating on the ice.\nAfter putting on his skates, George tried to walk and nearly twisted his ankle.\nFred next to him was even worse, falling directly to the ground, grinning in pain.\n\"I'm so angry, this guy really knows everything.\" Fred stood up slowly with Lee Jordan's support.\n\"Be careful, don't step on my feet.\" Lee Jordan reminded loudly.\n\"Are you all right?\" Shanna turned a corner and stopped in front of the two.\n\"I've told them all.\" Albert stopped next to Shanna, looked at the twin brothers who couldn't stand upright, and shook his head imperceptibly, \"It doesn't matter how many times you fell at the beginning, it's normal.\"\n\"You really know how to skate.\" Shanna looked at Albert's smooth movements and couldn't help but sigh, \"You really know everything!\"\n\"I played it before, my family taught me.\" Albert lied.\nIn fact, Albert has no talent in this area.After falling down several times during practice before, he was so angry that he directly used the panel to directly upgrade his skating skills to level 1.\n\"Who will teach us how to use this thing!\" George shouted at the two.\n\"This... I can't help you.\" Albert shrugged helplessly, and said to the twin brothers, \"My ice skating skills are terrible.\"\nAs if to reinforce what he just said, Albert nodded after finishing speaking, and repeated: \"Well, it sucks.\"\n\"Are you coming to skate too?\" Mario turned a corner and stopped in front of Albert's left.\nThe acrobatic trio are all skating here. Their skating skills are very skilled, and they can also perform various strange movements while skating.\nAlbert felt that all three of them could form a team to participate in the international skating competition.\n\"Mario, can you teach us how to skate this?\" George saw an acquaintance and hurriedly asked for help.\n\"I haven't started for a long time myself, so I don't know how to teach others.\" Albert noticed Jack's gaze and explained helplessly.\n\"This... is not a problem. However, we cannot guarantee that you can learn it. After all, skating also requires talent.\" Danny and the others don't mind helping them, after all, they are all from the Gryffindor team. The usual relationship is actually pretty good.\nAlbert saw that someone taught Weasley a few people, so he looked at Shannah and asked, \"Would you like to take a walk around the Black Lake together?\"\n\"I won't go.\" Shanna looked around the Black Lake and politely refused.\n\"See you later.\" Albert waved to a few people and started skating around the Black Lake. The Black Lake in Hogwarts is really big, and there are many students skating here on the shore near the castle.\nThe surface of the lake is very flat, and Albert glides around the shore of the lake, admiring the scenery on the shore of the lake.\nTo be honest, this feeling is very novel. He believes that many students do not actually enjoy the scenery around the school from all corners of the lake shore. It would be great if they brought their cameras.\nAlbert spent a lot of time circling the lake, and when he returned, he met a few acquaintances.\nThe red-haired McDougal sisters of Ravenclaw.\nJust as Katrina let go of her sister Isobel's hand, she fell to the ground after slipping a few steps.\nAlbert hurriedly circled around to avoid bumping into each other.\nFreshmen who are just getting started are very dangerous when practicing skating.After all, you never know when they're going to fall and when they're going to take you down with them.\n\"Are you okay?\" Seeing that Isobel didn't intend to help, Albert reached out and pulled Katrina up from the lake.\n\"Thank you.\" Katrina was a little embarrassed because Albert saw her embarrassed appearance, but thanked Albert very politely.\n\"Um, you're welcome.\" Albert was considering whether to let go, as the other party looked like he might fall at any time.\n\"Katrina, I'm afraid you don't have much talent in this area.\" Isobel looked at his sister helplessly.\n\"Long time no see, Isobel.\" Albert said, \"I've read your paper, it's great, it's a pity.\"\n\"Thank you.\" Isobel nodded and said, \"I never thought that I would be awarded the Most Promising Newcomer Award in Transfiguration today, and that would be too early for me.\"\n\"You two know each other?\" Katrina raised her eyebrows.\n\"Yes, we all participate in Professor McGonagall's transformation club.\" Albert explained.\n\"Albert is a genius in transfiguration.\" Isobel said suddenly.\n\"You two like to flatter each other so much?\" Katrina asked, looking at the two with a strange expression.\n\"It's not flattery, it's a fact.\" Isobel shook his head and said, \"By the way, I used a small part of your theory in my thesis.\"\n\"I don't mind.\" Albert waved his hand, \"Professor McGonagall told me about it, and I agreed, anyway, I found it from books.\"\n\"See you next time at the Transfiguration Club.\" Albert handed Katrina's hand to Isobel and turned to leave.\nIsobel suddenly stopped Albert.\n\"I heard that you are very familiar with Professor Broad?\" Isobel asked suddenly.\n\"?\" Albert couldn't help being taken aback, wondering why Isobel brought up this matter, but he still answered the other party's question:\n\"I'm not very familiar with it. I've been to Professor Brod's office a few times to discuss Defense Against the Dark Arts with him.\"\n\"It seems that Professor Broad is very optimistic about you.\" Isobel said meaningfully.\n\"What's the matter?\" Albert looked at Isobel suspiciously, feeling that Isobel's words had other meanings.\n\"Professor Brod is a very famous wizard. If you make friends with him, you can learn a lot.\" Isobel nodded and said, \"If you want to improve in a certain way, you need to work with him more. Talent exchange in this area.”\n\"Oh, thank you for your reminder.\" Albert was puzzled, but he still thanked the other party, then turned and left.\n\"Professor Broad is really all right? Just a relatively famous wizard?\" Albert was full of question marks, and he decided to take the time to check the information of Professor Broad.\nI always thought Professor Broad was a little weird.\nWhen Albert returned from skating around the Black Lake, Lee Jordan was still competing with his skating boots with the help of Mario.\nAs for Fred and George, these two guys have long since disappeared.\n\"Where's Brother Weasley?\" Albert asked suspiciously.\n\"They gave up.\" Danny shrugged and said, \"Only Lee Jordan is still persisting, but he also fell hard enough.\"\n(End of this chapter)\n\n\n\n"
  }
]